{
  "version": 2,
  "meta": {
    "source_files": [
      "data/LogNuovoPiccolo.json",
      "data/LogNuovoGrande.json",
      "data/0x06012c8cf97bead5deae237070f9587f8e7a266d.json",
      "data/0x323a76393544d5ecca80cd6ef2a560c6a395b7e3_from 13942537 - to 23483870.json",
      "data/0x35d1b3f3d7966a1dfe207aa4514c12a259a0492b_ from 8953736 - to 23228317.json",
      "data/0xb1690c08e213a35ed9bab7b318de14420fb57d8c.json",
      "data/0xb4e16d0168e52d35cacd2c6185b44281ec28c9dc_from 10019997 to 10961610.json",
      "data/0xbc4ca0eda7647a8ab7c2061c2e118a18a936f13d.json",
      "data/0xff9c1b15b16263c61d017ee9f65c50e4ae0113d7_ from 13108887 - to 13124897.json"
    ],
    "built_from": "train_only",
    "fingerprint": "9bf14326c9f8d256",
    "seed": 42,
    "train_size": 53191,
    "total_size": 88653
  },
  "out_vocab": {
    "[PAD]": 0,
    "[UNK]": 1,
    "[START]": 2,
    "functionName": 3,
    "createPromoKitty": 4,
    "transactionHash": 5,
    "[TXHASH]": 6,
    "contractAddress": 7,
    "[ADDR]": 8,
    "sender": 9,
    "gasUsed": 10,
    "[INT_LT1M]": 11,
    "blockNumber": 12,
    "[INT_LT1B]": 13,
    "timestamp": 14,
    "[TIMESTAMP_ISO]": 15,
    "value": 16,
    "[INT_0]": 17,
    "[INsSTART]": 18,
    "inputName": 19,
    "_genes": 20,
    "type": 21,
    "uint256": 22,
    "inputValue": 23,
    "[FLOAT]": 24,
    "_owner": 25,
    "address": 26,
    "[INsEND]": 27,
    "storageState": 28,
    "[LIST_0]": 29,
    "internalTxs": 30,
    "[INXsSTART]": 31,
    "[INXsEND]": 32,
    "events": 33,
    "[EVsSTART]": 34,
    "eventName": 35,
    "Birth": 36,
    "eventValues": 37,
    "1": 38,
    "[INT_LT100]": 39,
    "2": 40,
    "3": 41,
    "4": 42,
    "__length__": 43,
    "[INT_LT10]": 44,
    "owner": 45,
    "kittyId": 46,
    "matronId": 47,
    "sireId": 48,
    "genes": 49,
    "Transfer": 50,
    "from": 51,
    "to": 52,
    "tokenId": 53,
    "[EVsEND]": 54,
    "[END]": 55,
    "castVote": 56,
    "proposalId": 57,
    "support": 58,
    "uint8": 59,
    "[INT_1]": 60,
    "VoteCast": 61,
    "[INT_QUADRILLION]": 62,
    "[EMPTY_STR]": 63,
    "voter": 64,
    "weight": 65,
    "reason": 66,
    "withdraw": 67,
    "_tokenId": 68,
    "[INT_LT10K]": 69,
    "_to": 70,
    "[LIST_8]": 71,
    "callId": 72,
    "inputsCall": 73,
    "[LIST_1]": 74,
    "gas": 75,
    "output": 76,
    "[HEX32]": 77,
    "STATICCALL": 78,
    "depth": 79,
    "activity": 80,
    "lmPool": 81,
    "contractCalledName": 82,
    "PancakeV3Pool": 83,
    "[CALLS_START]": 84,
    "[CALLS_END]": 85,
    "name": 86,
    "currTimestamp": 87,
    "uint32": 88,
    "[INT_BILLION]": 89,
    "[NA]": 90,
    "CALL": 91,
    "accumulateReward": 92,
    "PancakeV3LmPool": 93,
    "[CALLSTART]": 94,
    "[HEX]": 95,
    "getLatestPeriodInfo": 96,
    "MasterChefV3": 97,
    "_v3Pool": 98,
    "[CALL_END]": 99,
    "tickLower": 100,
    "int24": 101,
    "tickUpper": 102,
    "getRewardGrowthInside": 103,
    "slot0": 104,
    "account": 105,
    "balanceOf": 106,
    "CakeOFT": 107,
    "amount": 108,
    "transfer": 109,
    "[INT_LT1K]": 110,
    "liquidityDelta": 111,
    "int128": 112,
    "updatePosition": 113,
    "maxLiquidityPerTick": 114,
    "safeTransferFrom": 115,
    "NonfungiblePositionManager": 116,
    "Harvest": 117,
    "pid": 118,
    "reward": 119,
    "eventFrom": 120,
    "UpdateLiquidity": 121,
    "5": 122,
    "liquidity": 123,
    "Withdraw": 124,
    "Approval": 125,
    "approved": 126,
    "harvest": 127,
    "getPastVotes": 128,
    "ENSToken": 129,
    "[INT_HUGE]": 130,
    "mintApe": 131,
    "numberOfTokens": 132,
    "[LIST_3]": 133,
    "lock": 134,
    "deadline": 135,
    "v": 136,
    "r": 137,
    "bytes32": 138,
    "s": 139,
    "DELEGATECALL": 140,
    "GovernanceProposalStateUpgrade": 141,
    "undefined": 142,
    "AdminUpgradeableProxy": 143,
    "[CALLS_CHILD_START]": 144,
    "updateRewardsOnLockedBalanceChange": 145,
    "TornadoStakingRewards": 146,
    "amountLockedBeforehand": 147,
    "CALLS_CHILD_END": 148,
    "permit": 149,
    "TORN": 150,
    "spender": 151,
    "transferFrom": 152,
    "recipient": 153,
    "RewardUpdateSuccessful": 154,
    "[LIST_2]": 155,
    "multicall": 156,
    "data": 157,
    "bytes[]": 158,
    "[LIST_5]": 159,
    "(uint256,uint128,uint256,uint256,uint256)": 160,
    "decreaseLiquidity": 161,
    "burn": 162,
    "uint128": 163,
    "positions": 164,
    "(uint256,address,uint128,uint128)": 165,
    "[LIST_4]": 166,
    "collect": 167,
    "amount0Requested": 168,
    "amount1Requested": 169,
    "WETH9": 170,
    "dst": 171,
    "wad": 172,
    "amountMinimum": 173,
    "unwrapWETH9": 174,
    "token": 175,
    "sweepToken": 176,
    "FiatTokenProxy": 177,
    "FiatTokenV2_2": 178,
    "DecreaseLiquidity": 179,
    "amount0": 180,
    "amount1": 181,
    "Collect": 182,
    "Burn": 183,
    "src": 184,
    "Withdrawal": 185,
    "createSiringAuction": 186,
    "_kittyId": 187,
    "_startingPrice": 188,
    "_endingPrice": 189,
    "_duration": 190,
    "_seller": 191,
    "createAuction": 192,
    "SiringClockAuction": 193,
    "KittyCore": 194,
    "_from": 195,
    "AuctionCreated": 196,
    "startingPrice": 197,
    "endingPrice": 198,
    "duration": 199,
    "[LIST_7]": 200,
    "CantoOFTV2": 201,
    "claim": 202,
    "setApprovalForAll": 203,
    "operator": 204,
    "bool": 205,
    "ApprovalForAll": 206,
    "cancelAuction": 207,
    "AuctionCancelled": 208,
    "approve": 209,
    "[INT_TRILLION]": 210,
    "StakedTokenV1": 211,
    "bid": 212,
    "x": 213,
    "mulFee": 214,
    "AuctionSuccessful": 215,
    "totalPrice": 216,
    "winner": 217,
    "giveBirth": 218,
    "_matronId": 219,
    "_genes1": 220,
    "_genes2": 221,
    "_targetBlock": 222,
    "mixGenes": 223,
    "GeneScience": 224,
    "setMarketAdminPermissionChecker": 225,
    "deposit": 226,
    "BadSignatureV": 227,
    "unlock": 228,
    "Governance": 229,
    "increaseLiquidity": 230,
    "params,tokenId,amount0Desired,amount1Desired,amount0Min,amount1Min,deadline": 231,
    "(uint256,uint256,uint256,uint256,uint256,uint256)": 232,
    "[LIST_6]": 233,
    "_value": 234,
    "TetherToken": 235,
    "mint": 236,
    "bytes": 237,
    "who": 238,
    "pancakeV3MintCallback": 239,
    "amount0Owed": 240,
    "amount1Owed": 241,
    "IncreaseLiquidity": 242,
    "Mint": 243,
    "6": 244,
    "Deposit": 245,
    "hope": 246,
    "usr": 247,
    "GovernanceStakingUpgrade": 248,
    "frxETH": 249,
    "withdrawTorn": 250,
    "TornadoVault": 251,
    "setPCFee": 252,
    "castVoteBySig": 253,
    "RocketTokenRETH": 254,
    "getUint": 255,
    "RocketStorage": 256,
    "_key": 257,
    "[LIST_9]": 258,
    "Dai": 259,
    "FiatTokenV2_1": 260,
    "int256": 261,
    "operate": 262,
    "lockWithApproval": 263,
    "error": 264,
    "execution reverted": 265,
    "revertReason": 266,
    "ERC20: transfer amount exceeds allowance": 267,
    "GovernancePatchUpgrade": 268,
    "ERC20Permit: invalid signature": 269,
    "updatePositionBoostMultiplier": 270,
    "FarmBoosterV3": 271,
    "userPositionInfos": 272,
    "removeBoostMultiplier": 273,
    "_user": 274,
    "_pid": 275,
    "UpdatePoolBoostMultiplier": 276,
    "user": 277,
    "oldMultiplier": 278,
    "newMultiplier": 279,
    "InvalidMsgValue": 280,
    "calculateFee": 281,
    "Transaction too old": 282,
    "createSaleAuction": 283,
    "SaleClockAuction": 284,
    "breedWithAuto": 285,
    "_sireId": 286,
    "Pregnant": 287,
    "cooldownEndBlock": 288,
    "OwnedUpgradeabilityProxy": 289,
    "TrueUSD": 290,
    "tokenLogic": 291,
    "UpdateMinerId": 292,
    "PepeToken": 293,
    "checkSecondLMPool": 294,
    "negativeRewardGrowthInsideInitValue": 295,
    "poolInfo": 296,
    "totalSupply": 297,
    "VECakeProxy": 298,
    "Inspect": 299,
    "bidOnSiringAuction": 300,
    "getCurrentPrice": 301,
    "[NONE]": 302,
    "0x": 303,
    "cashout": 304,
    "castDelegatedVote": 305,
    "address[]": 306,
    "Voted": 307,
    "votes": 308,
    "PxEth": 309,
    "lmTicks": 310,
    "TokenMintERC20Token": 311,
    "WBTC": 312,
    "GovernanceGasUpgrade": 313,
    "lmTicksFlag": 314,
    "negativeRewardGrowthInsideFlag": 315,
    "params,tokenId,recipient,amount0Max,amount1Max": 316,
    "NetMindTokenProxy": 317,
    "NetMindToken": 318,
    "[LIST_10]": 319,
    "castVoteWithReason": 320,
    "string": 321,
    "We are the best placed team to manage the research into, and deployment of productionised gateways noting that we built the codebase and have the appropriate domain knowledge. We have an incredible, and well documented track record in the ENS ecosystem and our proposal is for streamed funding conditional on us executing our milestones. Thank you for your support !": 322,
    "WrapTokenV1ETH": 323,
    "BurnableMintableCappedERC20": 324,
    "AlEth": 325,
    "queue": 326,
    "targets": 327,
    "values": 328,
    "uint256[]": 329,
    "calldatas": 330,
    "descriptionHash": 331,
    "ProposalQueued": 332,
    "eta": 333,
    "Discussed in forums and appears to be a reasonable step to take. Can be reverted without too much ado if it is a disaster.": 334,
    "TransparentUpgradeableProxy": 335,
    "swETH": 336,
    "gm": 337,
    "set": 338,
    "_allocPoint": 339,
    "_withUpdate": 340,
    "SetPool": 341,
    "allocPoint": 342,
    "unshETH": 343,
    "WootradeNetwork": 344,
    "AdminUpgradeabilityProxy": 345,
    "AETH_R18": 346,
    "add": 347,
    "pool": 348,
    "deploy": 349,
    "PancakeV3LmPoolDeployer": 350,
    "CREATE": 351,
    "nonfungiblePositionManager": 352,
    "factory": 353,
    "setLmPool": 354,
    "PancakeV3Factory": 355,
    "_lmPool": 356,
    "token0": 357,
    "token1": 358,
    "fee": 359,
    "allowance": 360,
    "AddPool": 361,
    "v3Pool": 362,
    "SetLmPoolEvent": 363,
    "addr": 364,
    "guy": 365,
    "_data": 366,
    "onERC721Received": 367,
    "NFT20Pair": 368,
    "implementation": 369,
    "UpgradeableBeacon": 370,
    "NFT20FactoryV7": 371,
    "NFT20FactoryV4": 372,
    "BlurToken": 373,
    "fork": 374,
    "ilk": 375,
    "dink": 376,
    "dart": 377,
    "execute": 378,
    "getPastTotalSupply": 379,
    "id": 380,
    "isOperationDone": 381,
    "TimelockController": 382,
    "datas": 383,
    "predecessor": 384,
    "salt": 385,
    "executeBatch": 386,
    "updatePodAdmin": 387,
    "ControllerV1": 388,
    "_podId": 389,
    "_newAdmin": 390,
    "ProposalExecuted": 391,
    "proposeByDelegate": 392,
    "target": 393,
    "description": 394,
    "{\"title\":\"Proposal #12: Tornado Cash Community Fund 2022 Grant\",\"description\":\"Tornado Cash Community Fund Grant for 2022.\\n\\nIf this proposal is voted favorably, 100,000 TORN, including 35,000 TORN at once and 65,000 TORN spread over 12 months (with Sablier) will be allocated to the community fund. \\n\\nThe purpose of this proposal is to ensure that the community fund has the necessary funds to continue to finance the development of the Tornado Cash DAO, as well as to ensure the capacity to pay the Immunefi bug bounties.\\n    \\n~ bt11ba   \\n\\nForum post link : https://torn.community/t/community-fund-grant-2022/\"}": 395,
    "ProposalCreated": 396,
    "proposer": 397,
    "startTime": 398,
    "endTime": 399,
    "delegate": 400,
    "Delegated": 401,
    "propose": 402,
    "[LIST_25]": 403,
    "7": 404,
    "8": 405,
    "# [EP 5.23] [Executable] blockful's governance security bounty\n## Summary\n\n\n\nThis proposal aims to compensate the blockful team for their work in identifying, analyzing, reporting and mitigating a severe vulnerability in ENS DAO's governance structure.\n\n\n\n## Background\n\n\n\nIn March 2024, blockful uncovered a critical vulnerability that could have led to a [~$150M](https://dune.com/steakhouse/ens-steakhouse) theft and protocol capture. Their subsequent work led to the implementation of the Security Council, significantly enhancing ENS DAO's resilience against attacks.\n\n\n\n## Contribution Details\n\n\n\nThe team involved is a [different](https://discuss.ens.domains/t/blockful-service-provider-reports/19553#p-54163-other-contributions-not-related-to-service-provider-scope-14) squad than the one working on the scope of the [ENS service provider](https://discuss.ens.domains/t/blockful-service-provider-reports/19553). It was developed by 2 researchers, 1 smart contract engineer and 4 different auditors the team has worked with previously. Summing up to ~600 hours, the scope includes:\n\n* Comprehensive vulnerability assessment and risk analysis: **[Here](https://mirror.xyz/research.blockful.eth/-PfMduhpxdypPrutofr6099T4ROpsAmX0fPNbvDgR\\_k)** is our detailed security report.\n\n* Data analysis of ENS governance metrics and study of past DAO attacker's behaviors.\n\n* Design, development and deployment of the Security Council contract and multisig.\n\n* The Security Council was thought with several key features to balance security and decentralization.\n\n* Smart contract implementation and testing ([GitHub](https://github.com/blockful-io/security-council-ens))\n\n* Governance proposal drafting and support [[1](https://snapshot.org/#/ens.eth/proposal/0xf3a4673fe04a3ecfed4a2f066f6ced1539a5466d61630428333360b843653c54), [2](https://snapshot.org/#/ens.eth/proposal/0xa0b1bfadf6853b5b0d59d3c4d73c434fc6389339887d05de805361372eb17c3a), [3](https://www.tally.xyz/gov/ens/proposal/42329103797433777309488042029679811802172320979541414683300183273376839219133)]\n\n\n\nMore details can be found on the links above for past proposals and the [report](https://mirror.xyz/research.blockful.eth/-PfMduhpxdypPrutofr6099T4ROpsAmX0fPNbvDgR\\_k).\n\n\n\n## Compensation Rationale\n\n\n\n&#x20;As a team that is totally bootstrapped and never received any investment, this support us to keep it sustainable with the resources invested towards this initiative. The requested amount represents fair compensation for:\n\n\n\n* The potential loss prevention of ~$150M, capture of the DAO and protocol. The attack is anything but theoretical and there are actually many groups of investors who specialize in \"risk free value raiders\". They have exerted the attack on other DAOs before. Currently there are [unknown whales](https://etherscan.io/address/0x245445940b317e509002eb682e03f4429184059d#tokentxns) buying ENS for +450 days and have ~2M ENS, showing how feasible the scenario is, more than the average quorum, in one wallet.\n\n* A critical code bug bounty in [ENS is $250k USDC](https://immunefi.com/bug-bounty/ens/scope/#assets). Our work was much beyond identifying and disclosing.\n\n* Significantly lower cost compared to standard rates charged by other security service providers in the DAO space, which typically demand liquid compensation. An example is that Open Zeppelin (one of the most reputable players in security) [charges $4M/year at Compound](https://compound.finance/governance/proposals/76), which recently [suffered](https://mirror.xyz/research.blockful.eth/v0GEP49oXP1gzMDlyP91-S4XIa8PIOd0vKq-6R8f54I) this type of attack.\n\n* Months of dedicated work by the team involved (researchers, devs and auditors).\n\n* The long-term value added to ENS through enhanced security.\n\n* Our commitment to ENS's long-term success and continued contribution, as evidenced by the 2-year vesting schedule.\n\n\n\n## Compensation Structure\n\n\n\n* Total amount: 100k USDC + 15k vested ENS tokens\n\n* Vesting period: 2 years\n\n* Vesting start date: April 8, 2024 (date of initial research disclosure)\n\n* Vesting schedule: Linear vesting\n\n* Will be sent to the meta-governance multisig, transferred, and vested to blockful.\n\n\n\n## Benefits to ENS DAO\n\n\n\n* Sets a positive precedent that **responsible vulnerability disclosure and correction are rewarded**, encouraging future security contributions\n\n* Preserves DAO treasury liquidity by using part of the bounty in ENS tokens instead of USDC or ETH\n\n* Enhances governance security by increasing the number of engaged, security-focused token holders\n\n## Conclusion\n\nBy approving this compensation, ENS DAO acknowledges the critical importance of security research and proactive governance improvements. The vesting structure ensures ongoing commitment and aligns incentives for continued contribution to ENS's security and stability.": 406,
    "signatures": 407,
    "startBlock": 408,
    "endBlock": 409,
    "MiniMeToken": 410,
    "_amount": 411,
    "onTransfer": 412,
    "AppProxyUpgradeable": 413,
    "getApp": 414,
    "KernelProxy": 415,
    "Kernel": 416,
    "_namespace": 417,
    "_appId": 418,
    "TokenManager": 419,
    "4.3": 420,
    "WstETH": 421,
    "undelegate": 422,
    "Undelegated": 423,
    "OrdiswapToken": 424,
    "MaticToken": 425,
    "CyberToken": 426,
    "getMinDelay": 427,
    "hashOperationBatch": 428,
    "delay": 429,
    "scheduleBatch": 430,
    "I vote FOR": 431,
    "compensateGas": 432,
    "GasCompensationVault": 433,
    "gasAmount": 434,
    "flux": 435,
    "frob": 436,
    "i": 437,
    "u": 438,
    "w": 439,
    "{\"title\":\"Proposal 36 - restore relayers\",\"description\":\"Restore mistakenly unregistered relayers in proposal 32\\n\\nTopic: https://forum.tornado.ws/t/proposal-36-restore-relayers/232\"}": 440,
    "I'm in general in support of the long-term management of the DAO funds to ensure a healthy future for funding the project as a whole; my only concern has been the current emphasis on Lido. The management team has socially agreed to take the DAO's feedback to heart when deciding the investment direction, which has overwhelmingly been to reduce the stake in Lido, so I consider my concerns addressed.": 441,
    "refundETH": 442,
    "[LIST_20]": 443,
    "# [EP 5.25] [Executable] Collective Working Group Funding Request (Oct 2024) - Resubmission\n\n[Temp Check Discourse link](https://discuss.ens.domains/t/ep-5-25-executable-collective-working-group-funding-request-oct-2024-resubmission/19847)\n\n\n ## Description \n\n## Description\nThis is a resubmission of [EP 5.24], with no changes to the funding amounts or technical specifications.\n\n## Abstract\nThis proposal executes all three Working Group funding requests for the October 2024 funding window as passed in [EP 5.17.1](https://discuss.ens.domains/t/5-17-1-social-funding-request-ens-meta-governance-working-group-term-5-oct-window/19677), [EP 5.17.2](https://discuss.ens.domains/t/5-17-2-social-funding-request-ens-ecosystem-working-group/19678), and [EP 5.17.3](https://discuss.ens.domains/t/5-17-3-social-funding-request-ens-public-goods-working-group/19679). For more detail, view the ENS Governance docs at https://basics.ensdao.org/funding-requests \n\n## Proposal Components\n\n---\n\n### 1) [Meta-governance Funding Request [EP 5.17.1]](https://discuss.ens.domains/t/5-17-1-social-funding-request-ens-meta-governance-working-group-term-5-oct-window/19677)\n\nThe Meta-governance Working Group requests funding to fulfill anticipated budgetary needs through the next formal funding window in April 2025.\n\n| Destination | USDC | ETH | $ENS |\n|:------------|:----:|:---:|:----:|\n| [ENS Meta-Gov Main Multisig](https://etherscan.io/address/0x91c32893216dE3eA0a55ABb9851f581d4503d39b) | 254,000 | 0 | 0 |\n\nThis amount will cover all expected expenses while maintaining a 100,000 USDC prudent reserve to ensure continuity if future funding is delayed.\n\n---\n\n### 2) [Ecosystem Funding Request [EP 5.17.2]](https://discuss.ens.domains/t/5-17-2-social-funding-request-ens-ecosystem-working-group/19678)\n\nThe ENS Ecosystem Working Group requests funding to support operations through April 2025. This is the only funding request of Term 5. The working group is responsible for growing and improving the ENS Ecosystem by funding builders and projects that are ENS-specific or ENS-centric.\n\n| Destination | USDC | ETH | $ENS |\n|:------------|:----:|:---:|:----:|\n| [ENS Ecosystem Main Multisig](https://etherscan.io/address/0x2686a8919df194aa7673244549e68d42c1685d03) | 836,000 | 0 | 0 |\n\n---\n\n### 3) [Public Goods Funding Request [EP 5.17.3]](https://discuss.ens.domains/t/5-17-3-social-funding-request-ens-public-goods-working-group/19679)\n\nThe ENS Public Goods Working Group requests funding to support operations through the next funding window in April 2025. The funds requested extend current needs through to next term to ensure that next season's stewards have available funding before the next funding window.\n\n| Destination | USDC | ETH | $ENS |\n|:------------|:----:|:---:|:----:|\n| [Public Goods Main Multisig](https://etherscan.io/address/0xcD42b4c4D102cc22864e3A1341Bb0529c17fD87d) | 226,000 | 0 | 0 |\n\n---\n\n## Specification\n\nThe following transfers are to be made from the DAO treasury:\n\n1. Transfer 254,000 USDC to the Meta-governance safe:\n   - Address: `0x91c32893216dE3eA0a55ABb9851f581d4503d39b`\n\n2. Transfer 836,000 USDC to the Ecosystem safe:\n   - Address: `0x2686A8919Df194aA7673244549E68D42C1685d03`\n\n3. Transfer 226,000 USDC to the Public Goods safe:\n   - Address: `0xcD42b4c4D102cc22864e3A1341Bb0529c17fD87d`\n\n#### Total transfer amount: 1,316,000 USDC\n\n---\n\n### Calldata:\n**5.17.1 Tx to Metagov**\n```\n{\n    \"target\": \"0xA0b86991c6218b36c1d19D4a2e9Eb0cE3606eB48\",\n    \"value\": 0,\n    \"calldata\": \"0xa9059cbb00000000000000000000000091c32893216de3ea0a55abb9851f581d4503d39b0000000000000000000000000000000000000000000000000000003b23946c00\"\n}\n```\n**5.17.2 Tx to Ecosystem**\n```\n{\n    \"target\": \"0xA0b86991c6218b36c1d19D4a2e9Eb0cE3606eB48\",\n    \"value\": 0,\n    \"calldata\": \"0xa9059cbb0000000000000000000000002686a8919df194aa7673244549e68d42c1685d03000000000000000000000000000000000000000000000000000000c2a57ba800\"\n}\n```\n**5.17.3 Tx to Public Goods**\n```\n{\n    \"target\": \"0xA0b86991c6218b36c1d19D4a2e9Eb0cE3606eB48\",\n    \"value\": 0,\n    \"calldata\": \"0xa9059cbb000000000000000000000000cd42b4c4d102cc22864e3a1341bb0529c17fd87d000000000000000000000000000000000000000000000000000000349ea65400\"\n}\n```": 444,
    "{\"title\":\"Proposal 38 - Compensating for relayers in oracle attacks\",\"description\":\"Compensating for relayers being incorrectly burned torn in oracle attacks\\nTopic: https://forum.tornado.ws/t/proposal-38-compensating-for-relayers-in-oracle-attacks/240\"}": 445,
    "BRC404": 446,
    "amountOrId": 447,
    "Price slippage check": 448,
    "Following consensus to vote against due to erroneous deployment.": 449,
    "SDT": 450,
    "good": 451,
    "WLD": 452,
    "Memecoin": 453,
    "PENDLE": 454,
    "https://discuss.ens.domains/t/ep-6-2-executable-endowment-expansion-3rd-tranche/19851": 455,
    "RocketTokenRPL": 456,
    "out of gas": 457,
    "ERC20Permit: expired deadline": 458,
    "ERC1967Proxy": 459,
    "TaikoToken": 460,
    "LinkToken": 461,
    "executeProposal": 462,
    "UpdateIpfsProposal": 463,
    "setContenthash": 464,
    "PublicResolver": 465,
    "node": 466,
    "hash": 467,
    "ENSRegistryWithFallback": 468,
    "ContenthashChanged": 469,
    "WrapTokenV2ETH": 470,
    "ERC20: transfer amount exceeds balance": 471,
    "[LIST_13]": 472,
    "# [EP6.12] [Executable] Set resolver for .ceo TLD\n# \\[EP6.12] \\[Executable] Set resolver for .ceo TLD\n\n| **Status** | Temp check                                                                        |\n| ---------- | --------------------------------------------------------------------------------- |\n| Discussion | [Link](https://discuss.ens.domains/t/executable-set-resolver-for-ceo-tld/20820/1) |\n\n## Abstract\n\n[EP6.7](https://discuss.ens.domains/t/ep-6-7-executable-transfer-ceo-tld-to-the-dnssec-registrar/20594) reconfigured the .ceo TLD, setting the owner record to the DNSSEC registrar contract. This allowed onchain claiming of .ceo 2LDs to resume, reclaiming control from a custom registrar that had been set by a previous owner of .ceo.\n\nUnfortunately, this neglected to consider the necessary infrastructure for offchain claiming, which requires also setting the resolver record. As a result, a follow-up executable EP is required to set the resolver also.\n\nTo prove ownership of .ceo and their intention that we action this request, they have set a TXT record on `_ens.nic.ceo` to the address of the DNSSEC registrar, `0xB32cB5677a7C971689228EC835800432B339bA2B`. This can be verified with the following command:\n\n```\ndig TXT _ens.nic.ceo\n```\n\n## Specification\n\n1. Call `setSubnodeOwner` on the ENS `Root` contract at `0xaB528d626EC275E3faD363fF1393A41F581c5897`, passing in the keccak256 hash of `ceo` and the address of the ENS timelock, `0xFe89cc7aBB2C4183683ab71653C4cdc9B02D44b7`.\n2. Call `setResolver` on the ENS registry contract at `0x00000000000C2E074eC69A0dFb2997BA6C7d2e1e`, passing in the namehash of `ceo` and the address of the `OffchainDNSResolver`, `0xF142B308cF687d4358410a4cB885513b30A42025`.\n3. Call `setOwner` on the ENS registry contract at  `0x00000000000C2E074eC69A0dFb2997BA6C7d2e1e`, passing in the namehash of `ceo` and the address of the DNSSEC reistrar at `0xB32cB5677a7C971689228EC835800432B339bA2B`.": 473,
    "{\"title\":\"Proposal 8: Governance Upgrade\",\"description\":\"Read all about it:\\n\\nhttps://torn.community/t/proposal-8-governance-upgrade-lock-user-funds-in-separate-vault/1232\"}": 474,
    "The proposal aligns well with the delegate's focus on improving the quality and usability of the ENS protocol. The suggestions, such as new yield-generation strategies for the endowment, represent improvements that could potentially lead to the betterment of the ENS protocol. In addition, the proposal has been audited by an independent party, which adds credibility to the changes suggested.": 475,
    "nope": 476,
    "RswETH": 477,
    "I'm voting this way because I love ENS DAO. Simple!": 478,
    "🎉🎉🎉": 479,
    "[LIST_44]": 480,
    "# [EP13] [Executable] Fund the Protocol Guild pilot with 200,000 $ENS\n# Abstract\nWe propose that 200k ENS (~3.7% of the [unclaimed airdrop](https://twitter.com/ensdomains/status/1522066354387718144)) be allocated in recognition of past and ongoing work of these core contributors.\n\nENS is one of the most successful projects built on Ethereum, and yet core protocol contributors do not benefit in any way from the success of projects being built on Ethereum. The Protocol Guild provides a vehicle for the ENS community to distribute governance tokens to those individuals who build and maintain the foundational infrastructure that ENS relies on.\n\nENS sponsorship of the Guild allows members to engage with ENS in a way that is values- and incentive-aligned. Simultaneously, it will allow them to continue the important work of scaling our shared infrastructure and making it as resilient as possible for the applications on top of it.\n\n# Specification\n## Useful links\n\n* [Protocol Guild Docs](https://protocol-guild.readthedocs.io/en/latest/index.html#)\n* [1 Year Vesting Contract](https://app.0xsplits.xyz/accounts/0xF29Ff96aaEa6C9A1fBa851f74737f3c069d4f1a9/)\n* [Split Contract](https://app.0xsplits.xyz/accounts/0x84af3D5824F0390b9510440B6ABB5CC02BB68ea1/)\n* [Initial Announcement - Dec 2021](https://stateful.mirror.xyz/mEDvFXGCKdDhR-N320KRtsq60Y2OPk8rHcHBCFVryXY)\n* [List of Members](https://protocol-guild.readthedocs.io/en/latest/9-membership.html)\n* [Protocol Guild twitter](https://twitter.com/ProtocolGuild)\n\n## Context\n\n1. As a credibly neutral, maximally uncapturable infrastructure with no block reward, the Ethereum base protocol doesn’t offer the same token incentives to contributors as applications or L2s can. However, the protocol still needs to attract and retain talent to continue to evolve. As the broader ecosystem continues to grow, competition for talented individuals will only increase. This isn’t to fault individuals for rationally weighting financial incentives, or protocols for leveraging the power of tokens - this is just the reality of the current context. We also acknowledge that financial motivations aren’t the only or best motivator for people, it’s just one tool in our toolset that is currently underleveraged.\n2. Existing public goods funding solutions tend to be either too narrow or broad in scope, fail to exclusively target core protocol contributors, or depend on an intermediating institution, which often leads to organizations, and not individuals, being recipients of funds.\n3. The Protocol benefits from contributor continuity. Transferring institutional knowledge between cohorts is more likely to happen successfully the more overlap there is.\n\nHere’s a longer exploration of the [project rationale](https://protocol-guild.readthedocs.io/en/latest/1-proposal-rationale.html).\n\nIf we believe what we are building is important, then we should structure the incentives to attract more smart people to work on it. After all, “Ethereum is an unprecedented arena for playing cooperative games”; we should try to manifest the novel possibilities made possible by this arena. ([Griffith, 2019](https://medium.com/@virgilgr/ethereum-is-game-changing-technology-literally-d67e01a01cf8))\n\n## What is the Protocol Guild?\n\nThe Protocol Guild aims to address the challenges mentioned above with a simple tool: a weighted split contract that includes vesting. Members will solicit sponsorships in the form of tokens from applications & protocols that build on Ethereum, which gives core contributors exposure to success at the application layer:\n\n* current contributors are rewarded for past work through time-based weighting\n* current contributors contribute for longer periods, resulting in less contributor churn\n* new contributors are incentivized to join core protocol work, protocol evolution and maintenance is more robust\n\nTo date, the membership includes over 110 Ethereum protocol contributors, including researchers, client maintainers, upgrade coordinators, and more, all self-curated (member list [here](https://protocol-guild.readthedocs.io/en/latest/9-membership.html)). This is a broad-based ecosystem effort: members come from 22 different teams and 9 organizations. Only 30% of members are directly employed by the EF. The membership is continuously curated through quarterly updates to the split contract - we expect the membership to grow to 150 over the course of the Pilot.\n\nThe Guild contracts will act as an autonomous value routing mechanism, operated independently from any existing institution, purpose-built for incentivizing long-term core protocol work. At no point does PG take custody of funds on behalf of members, it is all handled trustlessly. The diagram below and the [docs](https://protocol-guild.readthedocs.io/en/latest/3-smart-contract.html) have more information.\n\n![|602x387](https://user-images.githubusercontent.com/80278162/165815437-11646882-bac0-41bf-9709-e64880c96d82.png)\n\n## 2022 Pilot\n\nSince starting the project in Nov 2021, we’ve built norms around member onboarding , refined the splitting and vesting mechanisms, and created extensive documentation on how PG operates.\n\nAt this point, we’re ready to test the mechanism’s efficacy with a 1 year / $10-20mm Pilot. We want to make sure the mechanism operates smoothly before graduating to a full-scale fundraising round for longer vesting periods. The funds for the Pilot would be vested directly to Guild members over one year: see the [Pilot vesting contract here](https://app.0xsplits.xyz/accounts/0xF29Ff96aaEa6C9A1fBa851f74737f3c069d4f1a9/).\n\n## Proposal\n\nWe are proposing that 200k ENS (~3.7% of the [unclaimed airdrop](https://twitter.com/ensdomains/status/1522066354387718144)) be sent to the [Pilot vesting contract](https://app.0xsplits.xyz/accounts/0xF29Ff96aaEa6C9A1fBa851f74737f3c069d4f1a9/) deployed at 0xF29…f1a9 in recognition of the past and ongoing work of these core contributors.\n\nThe tokens would not be liquidated, but would vest for one year to each beneficiary listed on the underlying split. Each recipient would be making an independent decision about how to use their tokens once vested.\n\nThe USD value of the 200k ENS is $2.49mm as of the time of this post on May 25 2022. This is roughly in line with what we have already proposed to similarly prominent Ethereum-based protocols. [Lido’s 2mm LDO contribution](https://research.lido.fi/t/proposal-to-fund-the-protocol-guild-pilot-via-a-lido-grant/2016) was worth $2.6mm; the [active Uniswap proposal](https://gov.uniswap.org/t/governance-proposal-should-the-uniswap-community-participate-in-the-protocol-guild-pilot/16824) requesting 500k UNI would be worth $2.75mm.\n\nThere are a few reasons why supporting the Protocol Guild benefits the ENS community:\n\n* ENS’s long-term success is tightly coupled with the continued evolution and maintenance of the Ethereum protocol. These are projects that often have multi-year timelines. Contributing to the Pilot meaningfully increases the incentive to contribute to the core protocol, including:\n  * [The Merge](https://github.com/ethereum/pm/blob/master/Merge/mainnet-readiness.md): moving from PoW to PoS, increasing security and sustainability\n  * EVM improvements: new functionality for developers like [EOF](https://notes.ethereum.org/@ipsilon/evm-object-format-overview)\n  * [Statelessness](https://notes.ethereum.org/@gballet/Sy-a6T5St): sustainable management for state growth\n  * Supporting L2 scaling: [EIP-4844](https://eips.ethereum.org/EIPS/eip-4844), [EIP-4488](https://eips.ethereum.org/EIPS/eip-4488)\n  * [Proposer Builder Separation](https://notes.ethereum.org/@vbuterin/pbs_censorship_resistance): reducing centralizing incentives for consensus participants\n  * Continuous client maintenance: improving sync, exploring new database types, researching modular clients\n  * Coordinating network upgrades: making sure the community helps to shape and is aware of network upgrades\n* Having exposure to ENS allows protocol contributors to engage more with ENS governance. Members will be encouraged (but not obligated) to delegate them within the ENS governance framework.\n* ENS should be among the protocols maximally aligned with the Public Goods of the largest ecosystem it operates in. Pilot participation maintains and expands the ENS community’s existing reputation for funding Public Goods.\n* Diverse funding sources from the community further decentralizes protocol governance and prevents influence from pooling with any single entity.\n\nWe hope that a successful Pilot will pave the way for future funding collaborations between the ENS community and the Protocol Guild as we scale up the project after the Pilot. To that end, we think it’s important to demonstrate impact: learn more about how we intend to evaluate [Pilot outcomes here](https://protocol-guild.readthedocs.io/en/latest/5-initial-pilot.html). We have also adopted an active stance of continuous adjustments to improve PG while we operate the Pilot: improving documentation, resources for members, better transparency, etc.": 481,
    "swap": 482,
    "amount0Out": 483,
    "amount1Out": 484,
    "SignatureChecker": 485,
    "FiatTokenV1": 486,
    "uniswapV2Call": 487,
    "UniswapArbitrageur": 488,
    "UniswapV2Pair": 489,
    "buyBaseToken": 490,
    "DODO": 491,
    "maxPayQuote": 492,
    "getPrice": 493,
    "ChainlinkETHPriceOracleProxy": 494,
    "latestAnswer": 495,
    "Aggregator": 496,
    "Sync": 497,
    "reserve0": 498,
    "reserve1": 499,
    "Swap": 500,
    "amount0In": 501,
    "amount1In": 502,
    "out of gas: not enough gas for reentrancy sentry": 503,
    "METH": 504,
    "[LIST_27]": 505,
    "# [EP6.1] [Executable] Convert 6,000 ETH to USDC for DAO Operating Expenses\n\n# Abstract\n\nWe propose to convert 6,000 ETH into USDC to replenish the USDC reserves in the [DAO’s treasury](https://etherscan.io/address/0xfe89cc7abb2c4183683ab71653c4cdc9b02d44b7).\n\n\n# Motivation\n\nIn February 2023, the DAO executed a swap of 10,000 ETH into USDC via [EP 3.3](https://www.tally.xyz/gov/ens/proposal/45461903078948131870051132081249892009497709518413744958551889217805827301425), generating approximately $16.2M in USDC. The rationale at the time was to secure 18–24 months of operational runway.\n\nOver the past 21 months, the USDC reserves have been effectively utilised to fund ENS DAO’s operations. However, these reserves have now been fully depleted. To ensure financial stability and effective liquidity management, it is prudent to secure a 12-month runway in the DAO’s wallet to cover operating expenses.\n\nWe propose ENS convert 6,000 ETH (~$20.4M at $3,200/ETH) to replenish the USDC reserves. These funds will be used to meet ongoing commitments, such as payments to [ENS Labs](https://discuss.ens.domains/t/ep-5-22-ensv2-development-funding-request/19762), and [Service Provider streams](https://docs.ens.domains/dao/proposals/5.2) and DAO Working Groups.\n\n\n# Specification \n\nThe executable proposal will transfer 6,000 ETH from the ENS DAO Wallet to a [new Safe](https://etherscan.io/address/0x02D61347e5c6EA5604f3f814C5b5498421cEBdEB) created solely for the swap of ETH to USDC. The proposal will also sweep the ETH balance in the [Old Registrar Controller ](https://debank.com/profile/0x283af0b28c62c092c9727f1ee09c02ca627eb7f5)to the DAO wallet.\n\nThe payload to transfer 6k ETH from the DAO Multisig is available [here](https://gist.github.com/JeronimoHoulin/5e4728d36bf5d2b7ee08b9382f61bf78). Transaction details:\n\n\n\n* From: ENS DAO Wallet ([wallet.ensdao.eth](https://etherscan.io/address/0xFe89cc7aBB2C4183683ab71653C4cdc9B02D44b7#multichain-portfolio))\n* Token: ETH\n* Amount: 6,000\n* Recipient: TWAP Safe ([0x02D6…BdEB](https://app.safe.global/home?safe=eth:0x02D61347e5c6EA5604f3f814C5b5498421cEBdEB))\n\nkarpatkey has deployed a [new Safe](https://app.safe.global/home?safe=eth:0x02D61347e5c6EA5604f3f814C5b5498421cEBdEB) dedicated solely for TWAPs, with karpatkey and ENS representatives as signers. The Safe has a threshold of 3 signatures and the following signers:\n\n\n\n1. DAO Wallet ([wallet.ensdao.eth](https://etherscan.io/address/0xfe89cc7abb2c4183683ab71653c4cdc9b02d44b7))\n2. karpatkey’s Endowment manager Safe ([0xb423e0f6E7430fa29500c5cC9bd83D28c8BD8978](https://etherscan.io/address/0xb423e0f6E7430fa29500c5cC9bd83D28c8BD8978))\n3. ENS Labs’ cold wallet ([coldwallet.ens.eth](https://etherscan.io/address/0x690F0581eCecCf8389c223170778cD9D029606F2))\n4. Metagov Working Group Safe ([main.mg.wg.ens.eth](https://etherscan.io/address/0x91c32893216dE3eA0a55ABb9851f581d4503d39b)) \n\nThis allows for the segregation of funds between other ENS-related wallets (e.g. the Endowment Safe). This proposal sends 6,000 ETH to the newly created Safe.\n\nSigners will swap ETH to USDC via Cow’s TWAP mechanism. \n\nThe rationale behind this framework is that [Cow’s TWAP function](https://docs.cow.fi/cow-protocol/reference/contracts/programmatic/twap) is currently not supported by Tally or the Zodiac Roles Modifier (ZRM) permissions. Once TWAP permissions are integrated, ZRM can be onboarded to this Safe, allowing for the removal of the ENS signers.\n\nSafe keyholders will execute the following swaps:\n\n\n\n1. 1,000 ETH swap to meet immediate funding needs by the ENS DAO, executed as soon as funds become available.\n2. 5,000 ETH swap via a 3-month TWAP, conducted in 90 parts (~55.6 ETH sold per part), with wallet.ensdao.eth as recipient. \n\nThe payload to call withdraw() on the Old Registrar Controller, and send the funds to the DAO Multisig, is available [here](https://gist.github.com/JeronimoHoulin/f08e7a5704829df606602e53447569e3).\n\nTransaction details:\n\n\n\n* From: Old Registrar Controller (0x283af0b28c62c092c9727f1ee09c02ca627eb7f5)\n* Token: ETH\n* Amount: 4,241.966 (total balance)\n* Recipient: ENS DAO Wallet (wallet.ensdao.eth)": 506,
    "ETHx": 507,
    "Proposal": 508,
    "createStream": 509,
    "Sablier": 510,
    "tokenAddress": 511,
    "stopTime": 512,
    "CreateStream": 513,
    "streamId": 514,
    "nice": 515,
    "updateLiquidity": 516,
    "_spender": 517,
    "onApprove": 518,
    "agree": 519,
    "[LIST_16]": 520,
    "[LIST_12]": 521,
