{
  "version": 2,
  "meta": {
    "source_files": [
      "data/LogNuovoPiccolo.json",
      "data/LogNuovoGrande.json"
    ],
    "built_from": "train_only",
    "fingerprint": "b4358a94b484ab63",
    "seed": 42,
    "train_size": 17296,
    "total_size": 28827
  },
  "out_vocab": {
    "[PAD]": 0,
    "[UNK]": 1,
    "[START]": 2,
    "functionName": 3,
    "lock": 4,
    "transactionHash": 5,
    "[TXHASH]": 6,
    "contractAddress": 7,
    "[ADDR]": 8,
    "sender": 9,
    "gasUsed": 10,
    "[INT_LT1M]": 11,
    "blockNumber": 12,
    "[INT_LT1B]": 13,
    "timestamp": 14,
    "[TIMESTAMP_ISO]": 15,
    "value": 16,
    "[FLOAT]": 17,
    "[INsSTART]": 18,
    "inputName": 19,
    "owner": 20,
    "type": 21,
    "address": 22,
    "inputValue": 23,
    "amount": 24,
    "uint256": 25,
    "deadline": 26,
    "[INT_BILLION]": 27,
    "v": 28,
    "uint8": 29,
    "[INT_LT100]": 30,
    "r": 31,
    "bytes32": 32,
    "[HEX32]": 33,
    "s": 34,
    "[INsEND]": 35,
    "storageState": 36,
    "[LIST_0]": 37,
    "internalTxs": 38,
    "[INXsSTART]": 39,
    "callId": 40,
    "to": 41,
    "inputsCall": 42,
    "name": 43,
    "from": 44,
    "gas": 45,
    "[INT_0]": 46,
    "DELEGATECALL": 47,
    "depth": 48,
    "activity": 49,
    "contractCalledName": 50,
    "GovernanceStakingUpgrade": 51,
    "[CALLS_START]": 52,
    "[CALLSTART]": 53,
    "CALL": 54,
    "[INT_1]": 55,
    "undefined": 56,
    "AdminUpgradeableProxy": 57,
    "[CALLS_CHILD_START]": 58,
    "[INT_LT10]": 59,
    "updateRewardsOnLockedBalanceChange": 60,
    "TornadoStakingRewards": 61,
    "account": 62,
    "amountLockedBeforehand": 63,
    "[CALL_END]": 64,
    "CALLS_CHILD_END": 65,
    "permit": 66,
    "TORN": 67,
    "spender": 68,
    "[INT_LT10K]": 69,
    "output": 70,
    "STATICCALL": 71,
    "transferFrom": 72,
    "recipient": 73,
    "[CALLS_END]": 74,
    "events": 75,
    "[EVsSTART]": 76,
    "[EVsEND]": 77,
    "[INXsEND]": 78,
    "eventName": 79,
    "RewardUpdateSuccessful": 80,
    "eventValues": 81,
    "__length__": 82,
    "eventFrom": 83,
    "[LIST_2]": 84,
    "Approval": 85,
    "1": 86,
    "2": 87,
    "Transfer": 88,
    "[END]": 89,
    "harvest": 90,
    "_tokenId": 91,
    "_to": 92,
    "[LIST_7]": 93,
    "[LIST_1]": 94,
    "lmPool": 95,
    "PancakeV3Pool": 96,
    "[NA]": 97,
    "[HEX]": 98,
    "getLatestPeriodInfo": 99,
    "MasterChefV3": 100,
    "_v3Pool": 101,
    "slot0": 102,
    "balanceOf": 103,
    "CakeOFT": 104,
    "transfer": 105,
    "Harvest": 106,
    "3": 107,
    "4": 108,
    "pid": 109,
    "tokenId": 110,
    "reward": 111,
    "multicall": 112,
    "data": 113,
    "bytes[]": 114,
    "[LIST_5]": 115,
    "(uint256,uint128,uint256,uint256,uint256)": 116,
    "decreaseLiquidity": 117,
    "NonfungiblePositionManager": 118,
    "burn": 119,
    "tickLower": 120,
    "int24": 121,
    "tickUpper": 122,
    "uint128": 123,
    "[INT_TRILLION]": 124,
    "[INT_LT1K]": 125,
    "positions": 126,
    "[EMPTY_STR]": 127,
    "accumulateReward": 128,
    "PancakeV3LmPool": 129,
    "currTimestamp": 130,
    "uint32": 131,
    "getRewardGrowthInside": 132,
    "updatePosition": 133,
    "liquidityDelta": 134,
    "int128": 135,
    "maxLiquidityPerTick": 136,
    "(uint256,address,uint128,uint128)": 137,
    "[LIST_4]": 138,
    "collect": 139,
    "amount0Requested": 140,
    "[INT_QUADRILLION]": 141,
    "amount1Requested": 142,
    "WETH9": 143,
    "dst": 144,
    "wad": 145,
    "TetherToken": 146,
    "_value": 147,
    "amountMinimum": 148,
    "unwrapWETH9": 149,
    "withdraw": 150,
    "token": 151,
    "sweepToken": 152,
    "who": 153,
    "safeTransferFrom": 154,
    "UpdateLiquidity": 155,
    "5": 156,
    "liquidity": 157,
    "Withdraw": 158,
    "DecreaseLiquidity": 159,
    "amount0": 160,
    "amount1": 161,
    "Collect": 162,
    "approved": 163,
    "Burn": 164,
    "src": 165,
    "Withdrawal": 166,
    "undelegate": 167,
    "Governance": 168,
    "Undelegated": 169,
    "[LIST_8]": 170,
    "unlock": 171,
    "withdrawTorn": 172,
    "TornadoVault": 173,
    "[INT_HUGE]": 174,
    "GovernanceProposalStateUpgrade": 175,
    "updatePositionBoostMultiplier": 176,
    "FarmBoosterV3": 177,
    "userPositionInfos": 178,
    "BlueberryToken": 179,
    "_owner": 180,
    "removeBoostMultiplier": 181,
    "_user": 182,
    "_pid": 183,
    "UpdatePoolBoostMultiplier": 184,
    "user": 185,
    "oldMultiplier": 186,
    "newMultiplier": 187,
    "TransparentUpgradeableProxy": 188,
    "swETH": 189,
    "[LIST_3]": 190,
    "FiatTokenProxy": 191,
    "FiatTokenV2_1": 192,
    "PepeToken": 193,
    "AlEth": 194,
    "increaseLiquidity": 195,
    "params,tokenId,amount0Desired,amount1Desired,amount0Min,amount1Min,deadline": 196,
    "(uint256,uint256,uint256,uint256,uint256,uint256)": 197,
    "[LIST_6]": 198,
    "_from": 199,
    "mint": 200,
    "bytes": 201,
    "pancakeV3MintCallback": 202,
    "amount0Owed": 203,
    "amount1Owed": 204,
    "deposit": 205,
    "refundETH": 206,
    "IncreaseLiquidity": 207,
    "Mint": 208,
    "6": 209,
    "Deposit": 210,
    "lockWithApproval": 211,
    "GovernancePatchUpgrade": 212,
    "WootradeNetwork": 213,
    "params,tokenId,recipient,amount0Max,amount1Max": 214,
    "lmTicksFlag": 215,
    "lmTicks": 216,
    "checkSecondLMPool": 217,
    "negativeRewardGrowthInsideInitValue": 218,
    "unshETH": 219,
    "error": 220,
    "execution reverted": 221,
    "revertReason": 222,
    "ERC20Permit: invalid signature": 223,
    "WBTC": 224,
    "RocketTokenRETH": 225,
    "getUint": 226,
    "RocketStorage": 227,
    "_key": 228,
    "FiatTokenV2_2": 229,
    "castDelegatedVote": 230,
    "address[]": 231,
    "proposalId": 232,
    "support": 233,
    "bool": 234,
    "Voted": 235,
    "voter": 236,
    "votes": 237,
    "compensateGas": 238,
    "GasCompensationVault": 239,
    "gasAmount": 240,
    "PxEth": 241,
    "WstETH": 242,
    "BridgeToken": 243,
    "implementation": 244,
    "TokenBridge": 245,
    "BridgeImplementation": 246,
    "TokenImplementation": 247,
    "recipient_": 248,
    "amount_": 249,
    "GovernanceGasUpgrade": 250,
    "Inspect": 251,
    "METH": 252,
    "propose": 253,
    "target": 254,
    "description": 255,
    "string": 256,
    "{\"title\":\"Proposal #6: TORN Staking/Liquidity mining program\",\"description\":\"Distribute 120k TORN for a liquidity mining campaign on the Uniswap ETH/TORN pair lasting 6 months.\\n120k is about 43% of the currently available TORN token in the treasury and about 2.4% of the total treasury funds vested over 5 years. 6 months would means that the campaign will last until late October 2021.\\nThe contract used for the distribution is very the popular staking contract from Synthetix. It was audited by Sigma Prime in February 2020. This contract was also used by the Uniswap team in their original UNI distribution, Sushiswap, and many more Defi projects.\\n\\ncommunity post for more details: https://torn.community/t/proposal-6-torn-liquidity-mining-program/765\"}": 257,
    "ProposalCreated": 258,
    "id": 259,
    "proposer": 260,
    "startTime": 261,
    "endTime": 262,
    "Transaction too old": 263,
    "updateLiquidity": 264,
    "poolInfo": 265,
    "totalSupply": 266,
    "VECakeProxy": 267,
    "WLD": 268,
    "CyberToken": 269,
    "NetMindTokenProxy": 270,
    "NetMindToken": 271,
    "negativeRewardGrowthInsideFlag": 272,
    "CantoOFTV2": 273,
    "LinkToken": 274,
    "RocketTokenRPL": 275,
    "out of gas": 276,
    "MaskToken": 277,
    "frxETH": 278,
    "[LIST_9]": 279,
    "WrapTokenV2ETH": 280,
    "ERC20: transfer amount exceeds balance": 281,
    "StakedTokenV1": 282,
    "delegate": 283,
    "Delegated": 284,
    "[LIST_10]": 285,
    "OwnedUpgradeabilityProxy": 286,
    "TrueUSD": 287,
    "SDT": 288,
    "AIOZToken": 289,
    "PENDLE": 290,
    "BlurToken": 291,
    "ERC20Permit: expired deadline": 292,
    "add": 293,
    "_allocPoint": 294,
    "_withUpdate": 295,
    "pool": 296,
    "deploy": 297,
    "PancakeV3LmPoolDeployer": 298,
    "CREATE": 299,
    "nonfungiblePositionManager": 300,
    "factory": 301,
    "setLmPool": 302,
    "PancakeV3Factory": 303,
    "_lmPool": 304,
    "token0": 305,
    "token1": 306,
    "fee": 307,
    "allowance": 308,
    "AddPool": 309,
    "allocPoint": 310,
    "v3Pool": 311,
    "SetLmPoolEvent": 312,
    "addr": 313,
    "Memecoin": 314,
    "ERC1967Proxy": 315,
    "TaikoToken": 316,
    "L1MantleToken": 317,
    "BurnableMintableCappedERC20": 318,
    "RswETH": 319,
    "MaticToken": 320,
    "Dai": 321,
    "ENSToken": 322,
    "{\"title\":\"Proposal #31: Finalize sources decentralization\",\"description\":\"Details on forum:\\nEnglish topic - https://forum.tornado.ws/t/proposal-31-finalize-sources-decentralization/209\\nRussian topic - https://forum.tornado.ws/t/proposal-31-tornado/205\\n\\nP.S. Writing here so that relayers who are not in the chat can clearly see: read topic about attack (https://forum.tornado.ws/t/relayer-attack-analysis-and-mitigation/199) and reinstall new software version. It isn't required, but you can lose ETH balance if wouldn't do this.\"}": 323,
    "BRC404": 324,
    "amountOrId": 325,
    "execute": 326,
    "executeProposal": 327,
    "PenalisationProposal": 328,
    "getRelayerBalance": 329,
    "RelayerRegistry": 330,
    "relayer": 331,
    "unregisterRelayer": 332,
    "ProposalExecuted": 333,
    "Proposal": 334,
    "Tranfer": 335,
    "[LIST_11]": 336,
    "{\"title\":\"Deploy Tornado Cash on the Solana blockchain(without any code modifications, only to gauge the community’s attitude toward the extension)\",\"description\":\"https://t.me/TornadoCashOfficialDAO/14367\\nhttps://etherscan.io/address/0xc36ef9b313a50e6f56e571ab9f902643efadc119#code\\n\\nProposal 64 (without any code modifications, only to gauge the community’s attitude toward the extension)\\n  - Partnership Details  \\n\\n  - Partner: voidify (has been successfully operating since January without any rug-pull incidents or issues)  \\n\\n  - Objective: Deploy Tornado Cash on the Solana blockchain  \\n\\n  - Contributions  \\n         * V1 Version (If Proposal 64 passes, the scope of code modifications in Proposal 65)\\n                * Modify Tornado Cash Solidity code and re-implement contracts in Rust for Solana  \\n                * Add a “SOL” option on the Tornado Cash UI page, and ensure the interface is compatible with Solana contracts (the current frontend is not compatible with Solana wallet plugins, therefore an additional subpage will be used)  \\n                * Use a self-developed Node.js Indexer as the subgraph equivalent  \\n                * Do not modify any EVM-related code, only add SVM-related code  \\n\\n         * Since August, @tornadosto(https://t.me/tornadosto) and the void team have been working for two months to modify and redesign the original void frontend code for integration into the Tornado Cash UI  \\n\\n         * Increase the visibility and relevance of TORN during the current wave of privacy interest, showcasing that Tornado Cash remains active. Voidify also has a large promotional team\\n\\n         * To gain experience in Tornado Cash’s non-EVM chain expansion and in reclaiming fees on the BSC chain\\n\\n- Specific Details  \\nDue to the character limit, please refer to the DAO group information and the Etherscan code comments mentioned at the beginning for more details\\n\"}": 337,
    "{\"title\":\"Proposal #51: New cheater penalisation\",\"description\":\"Unregister new cheating relayer and withdraw his stake to Governance. Current proposal doesn't require any compensation to proposer (Theo).\\n\\nThere is no forum topic, because forum is currently down due to scammers abuse report.\"}": 338,
    "set": 339,
    "SetPool": 340,
    "setSubnodeOwner": 341,
    "ENSRegistryWithFallback": 342,
    "node": 343,
    "label": 344,
    "setContenthash": 345,
    "PublicResolver": 346,
    "hash": 347,
    "NewOwner": 348,
    "ContenthashChanged": 349,
    "OrdiswapToken": 350,
    "RelayerRegistryProposal": 351,
    "setMinStakeAmount": 352,
    "minAmount": 353,
    "setPeriodForTWAPOracle": 354,
    "FeeManager": 355,
    "newPeriod": 356,
    "setUniswapTornPoolSwappingFee": 357,
    "_uniswapTornPoolSwappingFee": 358,
    "uint24": 359,
    "setUpdateFeeTimeLimit": 360,
    "newLimit": 361,
    "[NONE]": 362,
    "upgradeTo": 363,
    "LoopbackProxy": 364,
    "newImplementation": 365,
    "getAllInstances": 366,
    "InstanceRegistry": 367,
    "updateInstance": 368,
    "TornadoProxy": 369,
    "(address,tuple)": 370,
    "InstanceStateUpdated": 371,
    "instance": 372,
    "state": 373,
    "WrapTokenV1ETH": 374,
    "{\"title\":\"Proposal #30: Tornado sources decentralization\",\"description\":\"Complete decentralization of Tornado Cash sources: all sites, services, software and npm packages.\\n\\nDetailed info on forum:\\nEnglish topic - https://forum.tornado.ws/t/proposal-30-tornado-sources-decentralization/182\\nRussian topic - https://forum.tornado.ws/t/proposal-30-tornado/181\"}": 375,
    "LayerZeroToken": 376,
    "{\"title\":\"Proposal #53: New cheater penalisation\",\"description\":\"Unregister new cheating relayer and withdraw his stake to Governance. Current proposal doesn't require any compensation to proposer (Theo).\\n\\nThere is no forum topic, because forum is currently down due to scammers abuse report.\"}": 377,
    "approve": 378,
    "cancelStream": 379,
    "Sablier": 380,
    "streamId": 381,
    "createStream": 382,
    "tokenAddress": 383,
    "stopTime": 384,
    "CancelStream": 385,
    "senderBalance": 386,
    "recipientBalance": 387,
    "CreateStream": 388,
    "ERC677BridgeToken": 389,
    "verifyTransfer": 390,
    "TransferManager": 391,
    "_amount": 392,
    "onTokenTransfer": 393,
    "0x": 394,
    "ContractFallbackCallFailed": 395,
    "TokenMintERC20Token": 396,
    "Price slippage check": 397,
    "AdminUpgradeabilityProxy": 398,
    "AETH_R18": 399,
    "proposeByDelegate": 400,
    "{ 'title':'Proposal #15: Accounting and remuneration' 'description': 'https://forums.tornadocash.community/t/15-remuneration-and-accounting/44' }": 401,
    "ETHx": 402,
    "Pandora": 403,
    "ERC20Transfer": 404,
    "{\"title\":\"Proposal 40 - burn 25% of TORN supply\",\"description\":\"Burn 25% of TORN supply ( 2,500,000 TORN ) to increase the value of TORN. The supply will unlikely be released otherwise it will only decrease TORN value.\\n\\nBurning the supply should be considered safe since the governance could unlock 2 million TORN in the future.\\n\\nSee the context of the full proposal at https://tornado-swap-proposal.eth.link https://tornado-swap-proposal.eth.limo https://forum.tornado.ws/t/burn-25-torn-supply-distribute-airdrop-to-stakers/280\\n\\nVoting on this proposal will also grant to receive an airdrop of the new coming TORN exchange.\"}": 405,
    "DelegateVotesChanged": 406,
    "previousBalance": 407,
    "newBalance": 408,
    "{\"title\":\"Proposal #39: Project costs reimbursement\",\"description\":\"Compensation for the costs of paying for all mandatory services to maintain the normal operation of the project for the next year (until December, 2024)\\n\\nDetailed info on forum:\\nEnglish topic - https://forum.tornado.ws/t/proposal-39-project-expenses-reimbursement/255\\nRussian topic - https://forum.tornado.ws/t/proposal-39/251\"}": 409,
    "{\"title\":\"Proposal #52: Restore UI IPFS\",\"description\":\"Restore old safe IPFS, which was created by me (Theo).\\nIPFS: https://gateway.ipfs.io/ipfs/bafybeib4rg5gx7plrvzasrrqa3tcb3tnzm2goxhteaxsbem6hjpzsgihbu\\nCurrent proposal doesn't require any compensation to proposer.\\n\\nThere is no forum topic, because forum is currently down due to scammers abuse report.\"}": 410,
    "PYUSDImplementation": 411,
    "FRAXShares": 412,
    "VoterVotesChanged": 413,
    "{\"title\":\"Implement fee sharing model\",\"description\":\"Currently all rewards go to LPs, reducing utility value for token holders who are just getting diluted for nothing. \\n\\nSplit token rewards and fees 50/50 between LPs and token holders as per Curve Finance token model - rewards can optionally be time weighted to create velocity sinks, and incentivise long term thinking.\\n\\n\\n\\n\"}": 414,
    "ERC20: transfer amount exceeds allowance": 415,
    "StargateToken": 416,
    "_addr": 417,
    "TCashProposal": 418,
    "vestedAmount": 419,
    "Vesting": 420,
    "release": 421,
    "released": 422,
    "startTimestamp": 423,
    "Released": 424,
    "WrappedNCG": 425,
    "RestoreRewardsProposal": 426,
    "accumulatedRewards": 427,
    "setReward": 428,
    "Upgraded": 429,
    "{\"title\":\"Proposal #7: Tornado Cash Community Fund\",\"description\":\"The Tornado Cash Community Fund is proposed to be seeded with 5% of the total protocol treasury. This includes an initial allocation of 22,916.66 TORN with an additional 4,583.33 TORN added per month for one year. The purpose of these funds is to reward active community contributors who play a key role in the growth of Tornado Cash.\\n\\nFull proposal: https://torn.community/t/proposal-7-tornado-cash-community-fund\"}": 430,
    "{\"title\":\"Proposal #27: Update IPFS content hashes and addresses on ENS\",\"description\":\"Set all updates made in the last three months on main tornado services (main site, Nova, documentation, software for relayers) into the ENS. \\n\\nDetailed info on forum:\\nEnglish topic - https://forum.tornado.ws/t/proposal-27-update-ipfs-content-hashes-and-addresses-on-ens/155\\nRussian topic - https://forum.tornado.ws/t/proposal-27-ipfs-ens/150\\n\\nImportant info for relayers:\\nIf the current proposal will be accepted and executed, the current version of the software for relayers (4.1.4 for Ethereum Mainnet, 5.0.0-beta for sidechains) will be marked as deprecated and relayers with the current version wont be listed in the UI (cannot be selected on main site). More info in forum topic, read it please.\"}": 431,
    "setSubnodeRecord": 432,
    "resolver": 433,
    "ttl": 434,
    "uint64": 435,
    "NewResolver": 436,
    "Proposal #14: Update ENS IPFS content": 437,
    "LiquidityMiningProposal": 438,
    "StakingRewards": 439,
    "notifyRewardAmount": 440,
    "OwnershipTransferred": 441,
    "previousOwner": 442,
    "newOwner": 443,
    "RewardAdded": 444,
    "rewardGrowthGlobalX128": 445,
    "lastRewardTimestamp": 446,
    "MiniMeToken": 447,
    "AlchemixToken": 448,
    "{\"title\":\"Proposal 37 - unregister all cheating relayers\",\"description\":\"Unregister all cheating relayers to prevent cheating with 500 torn\\nTopic: https://forum.tornado.ws/t/proposal-37-unregister-all-cheating-relayers/233\"}": 449,
    "_spender": 450,
    "onApprove": 451,
    "AppProxyUpgradeable": 452,
    "getApp": 453,
    "KernelProxy": 454,
    "Kernel": 455,
    "_namespace": 456,
    "_appId": 457,
    "TokenManager": 458,
    "withdrawFromHelper": 459,
    "MasaToken": 460,
    "{\"title\":\"ENS IPFS updates\",\"description\":\"https://forums.tornadocash.community/t/17-ens-ipfs-updates/142\"}": 461,
    "{\"title\":\"Proposal 38 - Compensating for relayers in oracle attacks\",\"description\":\"Compensating for relayers being incorrectly burned torn in oracle attacks\\nTopic: https://forum.tornado.ws/t/proposal-38-compensating-for-relayers-in-oracle-attacks/240\"}": 462,
    "{\"title\":\"Unregister new cheater\",\"description\":\"Unregister new cheating relayer and withdraw his balance to governance\\ncheating tx: https://etherscan.io/tx/0xd3be3b2fee39dc4d4918bfc3d3d0e7dcde9244cf52440bdabe434eb7b25bc96b\\nThe contract code is the same as proposal #42\"}": 463,
    "{\"title\":\"Subgraph recovery, Scam Reminder\",\"description\":\"In recent times, the community has made significant progress:\\n\\nThe subgraph for Tornado Cash has been relisted on The Graph. \\n\\nBelow are the multi-chain subgraphs:\\n\\nhttps://thegraph.com/explorer/profile/0x9bdccf2d73d2ed9e9354cdd1f4b73a70ff54288a?view=Subgraphs&chain=arbitrum-one\\n\\nETH subgraph: https://thegraph.com/explorer/subgraphs/DAaVDGqbwCJA1c3ccXqoYrBqWXAQ9nKaEnpFJSA2V7MP?view=Query&chain=arbitrum-one\\n\\nWe recommend users to install https://git.tornado.ws/tornadocash/classic-ui and modify the content in services/graph.js, update const CHAIN_GRAPH_URLS. \\n\\nThe Graph provides 100,000 free query limits per month.\\n\\nPlease be cautious of suspected scam Tornado Cash websites:\\n\\n1.tornadowithdraw.com - Scam, maliciously collects user information without verification\\n2.tornadoeth.cash - Scam, steals Note\\n3.tornado.dev - Scam, steals Note\"}": 464,
    "{\"title\": \"Proposal #10: Relayer registry\", \"description\": \"New decentralized relayer registry requiring a TORN stake to participate. The relayers pay a fee on each withdrawal processed. The fee is redistributed to TORN stakers. \nMore details on the proposal at: https://torn.community/t/proposal-relayer-registry-setting-parameters-after-audit/2134\"}": 465,
    "{\"title\":\"Proposal 46 - fix proposals state and update docs\",\"description\":\"Update proposal state function to show old proposals correctly on website and update docs corresponding to changes made in proposals 41 and 44\\n\\nTopic: https://forum.tornado.ws/t/proposal-46-fix-proposals-state-and-update-docs/318\"}": 466,
    "{\"title\":\"Proposal #63: Update ETH RPC List and ENS\",\"description\":\"Reason: The current ETH RPC List on the UI no longer support historical queries, necessitating an update to the default ETH RPC list.\\n\\nUI Update Details:\\n\\nETH RPCs: flashbotRPC, tornadoRPC, blockscoutRPC, kyberRPC, gasHawkRPC, lavaRPC.\\n\\nTarget: Update the IPFS hash for the Tornado Cash classic UI associated with the ENS domain tornadocash.eth.\\n\\nUI Code Repository: https://codeberg.org/torndao/classic-ui/commits/branch/development\\n\\nUI Code commit: https://codeberg.org/torndao/classic-ui/commit/30c4b44a5cd96811e17ef46d921ea8e1841a05d0\\n\\nIPFS Hash: bafybeiadcezfjx4ewel2xbdic66a4oj5ei6wtrvcbnirao5543cqtckukm (accessible via https://ipfs.io/ipfs/bafybeiadcezfjx4ewel2xbdic66a4oj5ei6wtrvcbnirao5543cqtckukm)\\n\\nIPFS Hash Verification Tool: https://codeberg.org/torndao/tornado-ipfs-ui\\n\\nContent Hash: e3010170122003113254df84b117ab846817bc0e393d223d69c6a20b51103bbde6c509895453 (calculated using the tool at https://codeberg.org/torndao/tornado-ipfs-ui/src/branch/main/ContentHash.html)\\n\\nAffected DomainsThe updated IPFS hash will affect the following domains:\\ntornadocash.eth.limo\\ntornadocash.eth.link\\nipfs.io/ipns/tornadocash.eth\\ntornadocash-eth.ipns.dweb.link\\n\"}": 467,
    "{\"title\":\"Proposal 45 - official dev\",\"description\":\"Sign on new official dev to deal with big proposals problem (https://forum.tornado.ws/t/big-proposals-problem/300) and develop Tornado faster and reliable\\n\\nTopic - https://forum.tornado.ws/t/proposal-45-official-dev/309\"}": 468,
    "{\"title\":\"Proposal #19: New developer, future plans and remuneration\",\"description\":\"https://forum.tornado.ws/t/proposal-19-new-dev-plans-for-project-development-and-remuneration/21\"}": 469,
    "{\"title\":\"Proposal 42 - Unregister new cheater\",\"description\":\"Unregister new cheating relayer and withdraw his balance to governance\\n\\nTopic: https://forum.tornado.ws/t/proposal-42-unregister-new-cheater-and-operator-discussion/285\"}": 470,
    "{\"title\":\"Proposal 36 - restore relayers\",\"description\":\"Restore mistakenly unregistered relayers in proposal 32\\n\\nTopic: https://forum.tornado.ws/t/proposal-36-restore-relayers/232\"}": 471,
    "{\"title\":\"Proposal #24: project costs reimbursement\",\"description\":\"Reimbursement for the maintenance of the project and its infrastructure: RPC's, servers, gas for the deployment of new large contracts, and so on.\\n\\nDetails in English: https://forum.tornado.ws/t/proposal-24-project-costs-reimbursement/102\\nDetails in Russian: https://forum.tornado.ws/t/proposal-24/104 \"}": 472,
    "{\"title\":\"Proposal #62: Add Ethereum Classic Support, Update ENS, and Distribute Cooperation Rewards\",\"description\":\"Cooperation Details\\n* Partner: HebeSwap\\n* Objective: Deploy Tornado Cash on the Ethereum Classic (ETC) network.\\n* Responsibilities: \\n    * HebeSwap will provide the initial liquidity pool.\\n    * HebeSwap will handle promotion efforts Tornado Cash on Ethereum Classic.\\nCooperation Reward\\n* Amount: One-time reward of 2000 TORN to HebeSwap.\\n* Purpose: To enable HebeSwap participation in governance.\\nContract Details\\nHebeSwap has implemented a 0.3% pool fee for the following contracts:\\n* 1 ETC: 0x2f56d5aFC058B8734350B162EFEe75ee48f034e0\\n* 10 ETC: 0x59fCB629A23e8eD0a60A0188771E221042260118\\n* 100 ETC: 0x784B3a7a7981B959bd8d9D9e73c2013BE819Fbf2\\nUI Update\\n* Target: Update the IPFS hash for Tornado Cash’s classic UI on the ENS domain tornadocash.eth.\\n* UI Code: https://codeberg.org/torndao/classic-ui/commit/b1e9965c621c4c8a0743d661f7228af0b76a28a0\\n* IPFS Hash:https://ipfs.io/ipfs/bafybeieffnocaq7t4w4daagvydl32igft5oziyyaebqr6vx6rb3fwh2ab4\\n* IPFS Hash Verify:https://codeberg.org/torndao/tornado-ipfs-ui\\n* Content Hash: e30101701220852b5c2043f3e5b83000d5c0d7bd20c59f5d94630020611f56fe88765b1f400f\\n* Calculation Tool: https://codeberg.org/torndao/tornado-ipfs-ui/src/branch/main/ContentHash.html\\nAffected Domains\\nThe updated IPFS hash will be reflected in the following domains:\\n* tornadocash.eth.limo\\n* tornadocash.eth.link\\n* ipfs.io/ipns/tornadocash.eth\\n* tornadocash-eth.ipns.dweb.link\\n\"}": 473,
    "UpdateIpfsProposal": 474,
    "{\"title\":\"Proposal 44 - Force withdrawals via relayers\",\"description\":\"Many users avoid Tornado Cash fee and do not pay to stakers 0.3% for each withdrawal. We can not change contract, but we can force withdrawal only via relayer in UI. Proposal also contains minor improvements like changing censored rpc etc.\"}": 475,
    "RelayerCompensationProposal": 476,
    "MultisigFundingProposal": 477,
    "ReimbursementProposal": 478,
    "out of gas: not enough gas for reentrancy sentry": 479,
    "{\"title\":\"Proposal 34 - cheating relayers patch\",\"description\":\"Unregister all cheating relayers, restore mistakenly unregistered relayers and compensate them downtime at the expense of cheaters and add operator functionality to relayer contract for possibly future use, if cheating relayers problem will still actual after this proposal (I do not think so).\\n\\nTopic (read all posts): https://forum.tornado.ws/t/proposal-34-cheating-relayers-patch/227\"}": 480,
    "{\"title\":\"Proposal #55: New cheater penalisation\",\"description\":\"Unregister new cheating relayer and withdraw his balance to governance\\ncheating tx: https://etherscan.io/tx/0xba9ff9c960fb1ad1856b271d887c7a7c3328abe2e8f0afeb38ed0847b1d0dc68\\nThe contract code is the same as proposal #42.\\n\\nThe reward for submitting proposals and paying gas is 100 TORN.\"}": 481,
    "[LIST_12]": 482,
    "{\"title\":\"Proposal #57: Tornado Cash Information Changes\",\"description\":\"At present, the TornadoCash community telegram groups are relatively scattered, such as: Chinese group, English group, Russian group, etc., all of which are created and maintained by individuals.\\nAnd these group owners are no longer active, which is very inconvenient for the maintenance and management of the community.\\nAnd there are many fake TornadoCash telegram groups and fake websites that specialize in fraud.\\nSo in order to better maintain the community, beware of being deceived, and protect the safety of personal property, the community decided to create a new group. \\nNew DAO group link: https://t.me/TornadoCashOfficialDAO\\nOfficial website link: https://ipfs.io/ipns/tornadocash.eth/\\nAnd apply to coinmarketcap and coingecko for link changes.\"}": 483,
    "{\"title\":\"Proposal #59: Lower the registration threshold for relayers - 1,000 TORN\",\"description\":\"Last time we raised the relay threshold to 5000 $TORN because the price of TORN was stable at $1.5. \\n\\nAnd now the price of TORN has reached $8. \\n\\nConsidering the current price situation, I suggest lowering the relay threshold to 1000 TORN, which can attract more relays to join.\"}": 484,
    "{\"title\":\"Proposal #16: #16: Relayer registry penalisation and configuration\",\"description\":\"https://forums.tornadocash.community/t/16-relayer-registry-penalisation-and-configuration/129\"}": 485,
    "RemunerationProposal": 486,
    "ProposalSetMiningRates": 487,
    "instances": 488,
    "TornadoCash_erc20": 489,
    "ERC20Tornado": 490,
    "CErc20Delegator": 491,
    "delegateToImplementation": 492,
    "CErc20Delegate": 493,
    "cTornado": 494,
    "setRates": 495,
    "Miner": 496,
    "(bytes32,uint256)[]": 497,
    "RateChanged": 498,
    "onTransfer": 499,
    "NovaUpgradeProposal": 500,
    "requireToPassMessage": 501,
    "ForeignAMB": 502,
    "_contract": 503,
    "_data": 504,
    "_gas": 505,
    "{\"title\":\"Proposal #4: Tornado Trees upgrade\",\"description\":\"TORN Mining is currently stuck because nobody is paying for the gas cost of updating the Merkle tree. This proposal would introduce a new Merkle tree leveraging Zero Knowledge proof that would be an order of magnitude cheaper to update and would therefore unstuck mining.\\n\\nThe tree contract is initialized with the latest Merkle root of the old tree contract. The new tree takes over from here. That means that if you are currently farming AP, you are not affected, you will be able to claim AP as expected once the tree is updated\\n\\nThe proposal will register the following pools with mining enabled:\\n\\n0.1 ETH 0x12D66f87A04A9E220743712cE6d9bB1B5616B8Fc\\n1 ETH 0x47CE0C6eD5B0Ce3d3A51fdb1C52DC66a7c3c2936\\n10 ETH 0x910Cbd523D972eb0a6f4cAe4618aD62622b39DbF\\n100 ETH 0xA160cdAB225685dA1d56aa342Ad8841c3b53f291\\n\\nSee this community post for more details: https://torn.community/t/proposal-4-tornado-trees-upgrade/636\"}": 506,
    "AETH_R21": 507,
    "{\"title\":\"Proposal 47 - sablier airdrop\",\"description\":\"Start airdrop with sablier-based tokens distribution\\n\\nTopic: https://forum.tornado.ws/t/proposals-47-48-airdrop/322\\n\\nIf you vote for this proposal, DO NOT VOTE FOR next proposal, vote AGAINST or ignore it - check explanation on forum\"}": 508,
    "{\"title\":\"Cheating relayers penalisation\",\"description\":\"Reset relayers balance, and torn back to governance. If executed, give gas back to developer say 15 TORN.\"}": 509,
    "registerRelayerAdmin": 510,
    "ensName": 511,
    "reltor.eth": 512,
    "stake": 513,
    "relayer007.eth": 514,
    "k-relayer.eth": 515,
    "VaultAndGasProposal": 516,
    "setVotingPeriod": 517,
    "votingPeriod": 518,
    "userVault": 519,
    "TornadoAuctionHandler": 520,
    "initializeAuction": 521,
    "_auctionEndDate": 522,
    "_auctionedSellAmount": 523,
    "uint96": 524,
    "_minBuyAmount": 525,
    "_minBidPerOrder": 526,
    "_minFundingThreshold": 527,
    "initiateAuction": 528,
    "EasyAuction": 529,
    "_auctioningToken": 530,
    "_biddingToken": 531,
    "orderCancellationEndDate": 532,
    "auctionEndDate": 533,
    "minimumBiddingAmountPerOrder": 534,
    "minFundingThreshold": 535,
    "isAtomicClosureAllowed": 536,
    "accessManagerContract": 537,
    "accessManagerContractData": 538,
    "UserRegistration": 539,
    "userId": 540,
    "NewUser": 541,
    "userAddress": 542,
    "NewAuction": 543,
    "7": 544,
    "8": 545,
    "9": 546,
    "10": 547,
    "11": 548,
    "auctionId": 549,
    "allowListContract": 550,
    "allowListData": 551,
    "{\"title\":\"Proposal 32 - Unregister cheating relayers\",\"description\":\"This proposal seeks to finally patch a loophole in Tornado relayers contract which allowed cheating relayers after nullifying their balance to stake again about 40 torn and be listed in the previous ui and old local version from archived Github.\\n\\nTopic: https://forum.tornado.ws/t/proposal-32-unregister-cheating-relayers/222\\n\\nLets smash all cheaters!\"}": 552,
    "{\"title\":\"Proposal #56: New cheater penalisation\",\"description\":\"Unregister new cheating relayer and withdraw his balance to governance\\ncheating tx: https://etherscan.io/tx/0xe1369db2ee6b2f6583d8eaff8138bb349ea1b7472f78db1b6f74dd4c00378824\\nThe contract code is the same as proposal #55.\\n\\nThe reward for submitting proposals and paying gas is 50 TORN.\"}": 553,
    "guy": 554,
    "{\"title\":\"Proposal 8: Governance Upgrade\",\"description\":\"Read all about it:\\n\\nhttps://torn.community/t/proposal-8-governance-upgrade-lock-user-funds-in-separate-vault/1232\"}": 555,
    "UpdateENSDataProposal": 556,
    "setAddr": 557,
    "a": 558,
    "AddressChanged": 559,
    "coinType": 560,
    "newAddress": 561,
    "AddrChanged": 562,
    "TokenProposalTransfersEnable": 563,
    "changeTransferability": 564,
    "decision": 565,
    "Unpaused": 566
  },
  "tree_vocab": {
    "[PAD]": 0,
    "[UNK]": 1,
    "0": 2,
    "0_1": 3,
    "0_1_1": 4,
    "0_1_1_1": 5,
    "0_1_2": 6,
    "0_1_2_1": 7,
    "0_1_3": 8,
    "0_2": 9,
    "0_2_1": 10,
    "0_3": 11,
    "0_3_1": 12,
    "0_4": 13,
    "0_5": 14,
    "0_1_1_2": 15,
    "0_1_3_1": 16,
    "0_1_4": 17,
    "0_1_4_1": 18,
    "0_1_5": 19,
    "0_1_6": 20,
    "0_1_7": 21,
    "0_1_7_1": 22,
    "0_1_7_2": 23,
    "0_2_1_1": 24,
    "0_2_1_1_1": 25,
    "0_2_1_1_2": 26,
    "0_3_2": 27,
    "0_3_2_1": 28,
    "0_3_3": 29,
    "0_4_1": 30,
    "0_4_2": 31,
    "0_5_1": 32,
    "0_5_2": 33,
    "0_5_3": 34,
    "0_5_3_1": 35,
    "0_5_4": 36,
    "0_5_5": 37,
    "0_5_6": 38,
    "0_5_7": 39,
    "0_5_7_1": 40,
    "0_5_7_2": 41,
    "0_5_7_3": 42,
    "0_5_8": 43,
    "0_6": 44,
    "0_7": 45,
    "0_7_1": 46,
    "0_7_2": 47,
    "0_8": 48,
    "0_1_6_1": 49,
    "0_1_8": 50,
    "0_1_8_1": 51,
    "0_1_8_2": 52,
    "0_5_9": 53,
    "0_2_1_1_2_1": 54,
    "0_4_1_1": 55,
    "0_4_2_1": 56,
    "0_1_1_3": 57,
    "0_1_1_3_1": 58,
    "0_1_1_3_1_1": 59,
    "0_1_1_3_2": 60,
    "0_2_2": 61,
    "0_2_2_1": 62,
    "0_2_3": 63,
    "0_3_1_1": 64,
    "0_2_2_2": 65,
    "0_2_2_3": 66,
    "0_2_2_3_1": 67,
    "0_2_2_3_2": 68,
    "0_2_2_3_3": 69,
    "0_2_2_4": 70,
    "0_2_2_5": 71,
    "0_9": 72,
    "0_10": 73,
    "0_10_1": 74,
    "0_10_2": 75,
    "0_10_3": 76,
    "0_5_5_1": 77,
    "0_5_5_2": 78,
    "0_5_5_3": 79,
    "0_1_7_3": 80,
    "0_3_3_1": 81,
    "0_3_4": 82,
    "0_3_5": 83,
    "0_3_6": 84,
    "0_3_7": 85,
    "0_3_7_1": 86,
    "0_3_7_2": 87,
    "0_3_7_3": 88,
    "0_3_8": 89,
    "0_3_2_1_1": 90,
    "0_3_2_2": 91,
    "0_3_2_3": 92,
    "0_3_2_3_1": 93,
    "0_3_2_3_1_1": 94,
    "0_3_2_3_2": 95,
    "0_3_2_4": 96,
    "0_3_2_4_1": 97,
    "0_3_2_5": 98,
    "0_6_1": 99,
    "0_9_1": 100,
    "0_9_2": 101,
    "0_9_3": 102,
    "0_2_2_1_1": 103,
    "0_2_2_3_1_1": 104,
    "0_2_2_4_1": 105,
    "0_8_1": 106,
    "0_8_2": 107,
    "0_1_3_1_1": 108,
    "0_1_3_2": 109,
    "0_1_4_2": 110,
    "0_1_4_3": 111,
    "0_1_4_4": 112,
    "0_1_4_5": 113,
    "0_1_4_6": 114,
    "0_1_4_7": 115,
    "0_1_7_4": 116,
    "0_1_7_5": 117,
    "0_1_7_6": 118,
    "0_2_1_1_1_1": 119,
    "0_3_5_1": 120,
    "0_3_5_2": 121,
    "0_3_5_3": 122,
    "0_7_3": 123,
    "0_2_1_1_1_1_1": 124,
    "0_2_1_1_1_2": 125,
    "0_8_3": 126,
    "0_3_9": 127,
    "0_9_4": 128,
    "0_9_5": 129,
    "0_11": 130,
    "0_11_1": 131,
    "0_11_2": 132,
    "0_11_3": 133,
    "0_1_8_3": 134,
    "0_7_4": 135,
    "0_2_2_2_1": 136,
    "0_2_2_2_2": 137,
    "0_3_2_2_1": 138,
    "0_3_2_2_1_1": 139,
    "0_2_1_2": 140,
    "0_2_1_3": 141,
    "0_2_1_3_1": 142,
    "0_2_1_3_2": 143,
    "0_2_1_3_2_1": 144,
    "0_3_2_3_2_1": 145,
    "0_3_2_5_1": 146,
    "0_2_1_3_1_1": 147,
    "0_1_1_1_1": 148,
    "0_1_1_1_2": 149,
    "0_1_1_4": 150,
    "0_1_1_4_1": 151,
    "0_1_1_5": 152,
    "0_1_1_6": 153,
    "0_1_1_7": 154,
    "0_1_1_7_1": 155,
    "0_1_1_7_2": 156,
    "0_1_1_7_3": 157,
    "0_1_2_1_1": 158,
    "0_1_2_1_2": 159,
    "0_1_2_1_3": 160,
    "0_1_2_1_3_1": 161,
    "0_1_3_2_1": 162,
    "0_1_3_3": 163,
    "0_1_5_1": 164,
    "0_1_5_2": 165,
    "0_1_5_3": 166,
    "0_1_5_3_1": 167,
    "0_1_5_4": 168,
    "0_1_5_5": 169,
    "0_7_5": 170,
    "0_7_6": 171,
    "0_7_7": 172,
    "0_7_8": 173,
    "0_1_1_3_2_1": 174,
    "0_1_6_2": 175,
    "0_1_6_3": 176,
    "0_1_6_4": 177,
    "0_1_6_5": 178,
    "0_11_4": 179,
    "0_11_4_1": 180,
    "0_12": 181,
    "0_13": 182,
    "0_14": 183,
    "0_15": 184,
    "0_16": 185,
    "0_16_1": 186,
    "0_1_2_1_3_2": 187,
    "0_2_3_1": 188,
    "0_2_4": 189,
    "0_2_5": 190,
    "0_8_4": 191,
    "0_8_5": 192,
    "0_2_2_3_3_1": 193,
    "0_2_2_5_1": 194,
    "0_1_1_2_1": 195,
    "0_12_1": 196,
    "0_14_1": 197,
    "0_17": 198,
    "0_18": 199,
    "0_18_1": 200,
    "0_19": 201,
    "0_20": 202,
    "0_21": 203,
    "0_22": 204,
    "0_22_1": 205,
    "0_23": 206,
    "0_24": 207,
    "0_25": 208,
    "0_26": 209,
    "0_27": 210,
    "0_1_3_4": 211,
    "0_1_3_5": 212,
    "0_1_3_6": 213,
    "0_1_1_8": 214,
    "0_1_1_9": 215,
    "0_1_1_10": 216,
    "0_1_1_11": 217,
    "0_1_1_12": 218,
    "0_1_1_13": 219,
    "0_1_1_14": 220,
    "0_1_1_15": 221,
    "0_1_1_16": 222,
    "0_1_1_17": 223,
    "0_1_1_18": 224,
    "0_1_1_19": 225,
    "0_1_1_20": 226,
    "0_1_1_21": 227,
    "0_1_1_22": 228,
    "0_1_1_23": 229,
    "0_1_1_24": 230,
    "0_1_1_25": 231,
    "0_1_1_26": 232,
    "0_1_3_7": 233,
    "0_1_3_8": 234,
    "0_1_3_9": 235,
    "0_2_3_2": 236,
    "0_2_3_3": 237,
    "0_2_3_4": 238,
    "0_2_3_5": 239,
    "0_8_6": 240,
    "0_8_7": 241,
    "0_8_8": 242,
    "0_1_1_2_2": 243,
    "0_8_9": 244,
    "0_8_10": 245,
    "0_8_11": 246,
    "0_1_4_8": 247,
    "0_1_4_9": 248,
    "0_1_7_7": 249,
    "0_1_7_8": 250,
    "0_10_4": 251,
    "0_10_5": 252,
    "0_12_2": 253,
    "0_12_3": 254,
    "0_2_3_6": 255,
    "0_2_3_7": 256,
    "0_1_1_5_1": 257,
    "0_1_1_6_1": 258,
    "0_1_1_8_1": 259,
    "0_1_1_9_1": 260,
    "0_1_1_10_1": 261,
    "0_1_1_11_1": 262,
    "0_1_1_12_1": 263,
    "0_1_1_13_1": 264,
    "0_1_1_14_1": 265,
    "0_1_1_15_1": 266,
    "0_1_1_16_1": 267,
    "0_1_1_17_1": 268,
    "0_1_1_18_1": 269,
    "0_1_1_19_1": 270,
    "0_1_1_20_1": 271,
    "0_1_1_21_1": 272,
    "0_1_1_22_1": 273,
    "0_1_1_23_1": 274,
    "0_1_1_24_1": 275,
    "0_1_1_25_1": 276,
    "0_1_1_26_1": 277,
    "0_1_1_27": 278,
    "0_1_1_27_1": 279,
    "0_1_1_28": 280,
    "0_1_1_28_1": 281,
    "0_1_1_29": 282,
    "0_1_1_29_1": 283,
    "0_1_1_30": 284,
    "0_1_1_30_1": 285,
    "0_1_1_31": 286,
    "0_1_1_31_1": 287,
    "0_1_1_32": 288,
    "0_1_1_32_1": 289,
    "0_1_1_33": 290,
    "0_1_1_33_1": 291,
    "0_1_1_34": 292,
    "0_1_1_34_1": 293,
    "0_1_1_35": 294,
    "0_1_1_35_1": 295,
    "0_1_1_36": 296,
    "0_1_1_36_1": 297,
    "0_1_1_37": 298,
    "0_1_1_37_1": 299,
    "0_1_1_38": 300,
    "0_1_1_38_1": 301,
    "0_1_1_39": 302,
    "0_1_1_39_1": 303,
    "0_1_1_40": 304,
    "0_1_1_40_1": 305,
    "0_1_1_41": 306,
    "0_1_1_41_1": 307,
    "0_1_1_42": 308,
    "0_1_1_42_1": 309,
    "0_1_1_43": 310,
    "0_1_1_43_1": 311,
    "0_1_1_44": 312,
    "0_1_1_44_1": 313,
    "0_1_1_45": 314,
    "0_1_1_45_1": 315,
    "0_1_1_46": 316,
    "0_1_1_46_1": 317,
    "0_1_1_47": 318,
    "0_1_1_47_1": 319,
    "0_1_1_48": 320,
    "0_1_1_48_1": 321,
    "0_1_1_49": 322,
    "0_1_1_49_1": 323,
    "0_1_1_50": 324,
    "0_1_1_50_1": 325,
    "0_1_1_51": 326,
    "0_1_1_51_1": 327,
    "0_1_1_52": 328,
    "0_1_1_52_1": 329,
    "0_1_1_53": 330,
    "0_1_1_53_1": 331,
    "0_1_1_54": 332,
    "0_1_1_54_1": 333,
    "0_1_1_55": 334,
    "0_1_1_55_1": 335,
    "0_1_1_56": 336,
    "0_1_1_56_1": 337,
    "0_1_1_57": 338,
    "0_1_1_57_1": 339,
    "0_1_1_58": 340,
    "0_1_1_58_1": 341,
    "0_1_1_59": 342,
    "0_1_1_59_1": 343,
    "0_1_1_60": 344,
    "0_1_1_60_1": 345,
    "0_1_1_61": 346,
    "0_1_1_61_1": 347,
    "0_1_1_62": 348,
    "0_1_1_62_1": 349,
    "0_1_1_63": 350,
    "0_1_1_63_1": 351,
    "0_1_1_64": 352,
    "0_1_1_64_1": 353,
    "0_1_1_65": 354,
    "0_1_1_65_1": 355,
    "0_1_1_66": 356,
    "0_1_1_66_1": 357,
    "0_1_1_67": 358,
    "0_1_1_67_1": 359,
    "0_1_1_68": 360,
    "0_1_1_68_1": 361,
    "0_1_1_69": 362,
    "0_1_1_69_1": 363,
    "0_1_1_70": 364,
    "0_1_1_70_1": 365,
    "0_1_1_71": 366,
    "0_1_1_71_1": 367,
    "0_1_1_72": 368,
    "0_1_1_72_1": 369,
    "0_1_1_73": 370,
    "0_1_1_73_1": 371,
    "0_1_1_74": 372,
    "0_1_1_74_1": 373,
    "0_1_1_75": 374,
    "0_1_1_75_1": 375,
    "0_1_1_76": 376,
    "0_1_1_76_1": 377,
    "0_1_1_77": 378,
    "0_1_1_77_1": 379,
    "0_1_1_78": 380,
    "0_1_1_78_1": 381,
    "0_1_1_79": 382,
    "0_1_1_79_1": 383,
    "0_1_1_80": 384,
    "0_1_1_80_1": 385,
    "0_1_1_81": 386,
    "0_1_1_81_1": 387,
    "0_1_1_82": 388,
    "0_1_1_82_1": 389,
    "0_1_1_83": 390,
    "0_1_1_83_1": 391,
    "0_1_1_84": 392,
    "0_1_1_84_1": 393,
    "0_1_1_85": 394,
    "0_1_1_85_1": 395,
    "0_1_1_86": 396,
    "0_1_1_86_1": 397,
    "0_1_1_87": 398,
    "0_1_1_87_1": 399,
    "0_1_1_88": 400,
    "0_1_1_88_1": 401,
    "0_1_1_89": 402,
    "0_1_1_89_1": 403,
    "0_1_1_90": 404,
    "0_1_1_90_1": 405,
    "0_1_1_91": 406,
    "0_1_1_91_1": 407,
    "0_1_1_92": 408,
    "0_1_1_92_1": 409,
    "0_1_1_93": 410,
    "0_1_1_93_1": 411,
    "0_1_1_94": 412,
    "0_1_1_94_1": 413,
    "0_1_1_95": 414,
    "0_1_1_95_1": 415,
    "0_1_1_96": 416,
    "0_1_1_96_1": 417,
    "0_1_1_97": 418,
    "0_1_1_97_1": 419,
    "0_1_1_98": 420,
    "0_1_1_98_1": 421,
    "0_1_1_99": 422,
    "0_1_1_99_1": 423,
    "0_1_1_100": 424,
    "0_1_1_100_1": 425,
    "0_1_1_101": 426,
    "0_1_1_101_1": 427,
    "0_1_1_102": 428,
    "0_1_1_102_1": 429,
    "0_1_1_103": 430,
    "0_1_1_103_1": 431,
    "0_1_1_104": 432,
    "0_1_1_104_1": 433,
    "0_1_1_105": 434,
    "0_1_1_105_1": 435,
    "0_1_1_106": 436,
    "0_1_1_106_1": 437,
    "0_1_1_107": 438,
    "0_1_1_107_1": 439,
    "0_1_1_108": 440,
    "0_1_1_108_1": 441,
    "0_1_1_109": 442,
    "0_1_1_109_1": 443,
    "0_1_1_110": 444,
    "0_1_1_110_1": 445,
    "0_1_1_111": 446,
    "0_1_1_111_1": 447,
    "0_1_1_112": 448,
    "0_1_1_112_1": 449,
    "0_1_1_113": 450,
    "0_1_1_113_1": 451,
    "0_1_1_114": 452,
    "0_1_1_114_1": 453,
    "0_1_1_115": 454,
    "0_1_1_115_1": 455,
    "0_1_1_116": 456,
    "0_1_1_116_1": 457,
    "0_1_1_117": 458,
    "0_1_1_117_1": 459,
    "0_1_1_118": 460,
    "0_1_1_118_1": 461,
    "0_1_1_119": 462,
    "0_1_1_119_1": 463,
    "0_1_1_120": 464,
    "0_1_1_120_1": 465,
    "0_1_1_121": 466,
    "0_1_1_121_1": 467,
    "0_1_1_122": 468,
    "0_1_1_122_1": 469,
    "0_1_1_123": 470,
    "0_1_1_123_1": 471,
    "0_1_1_124": 472,
    "0_1_1_124_1": 473,
    "0_1_1_125": 474,
    "0_1_1_125_1": 475,
    "0_1_1_126": 476,
    "0_1_1_126_1": 477,
    "0_1_1_127": 478,
    "0_1_1_127_1": 479,
    "0_1_1_128": 480,
    "0_1_1_128_1": 481,
    "0_1_1_129": 482,
    "0_1_1_129_1": 483,
    "0_1_1_130": 484,
    "0_1_1_130_1": 485,
    "0_1_1_131": 486,
    "0_1_1_131_1": 487,
    "0_1_1_132": 488,
    "0_1_1_132_1": 489,
    "0_1_1_133": 490,
    "0_1_1_133_1": 491,
    "0_1_1_134": 492,
    "0_1_1_134_1": 493,
    "0_1_1_135": 494,
    "0_1_1_135_1": 495,
    "0_1_1_136": 496,
    "0_1_1_136_1": 497,
    "0_1_1_137": 498,
    "0_1_1_137_1": 499,
    "0_1_1_138": 500,
    "0_1_1_138_1": 501,
    "0_1_1_139": 502,
    "0_1_1_139_1": 503,
    "0_1_1_140": 504,
    "0_1_1_140_1": 505,
    "0_1_1_141": 506,
    "0_1_1_141_1": 507,
    "0_1_1_142": 508,
    "0_1_1_142_1": 509,
    "0_1_1_143": 510,
    "0_1_1_143_1": 511,
    "0_1_1_144": 512,
    "0_1_1_144_1": 513,
    "0_1_1_145": 514,
    "0_1_1_145_1": 515,
    "0_1_1_146": 516,
    "0_1_1_146_1": 517,
    "0_1_1_147": 518,
    "0_1_1_147_1": 519,
    "0_1_1_148": 520,
    "0_1_1_148_1": 521,
    "0_1_1_149": 522,
    "0_1_1_149_1": 523,
    "0_1_1_150": 524,
    "0_1_1_150_1": 525,
    "0_1_1_151": 526,
    "0_1_1_151_1": 527,
    "0_1_1_152": 528,
    "0_1_1_152_1": 529,
    "0_1_1_153": 530,
    "0_1_1_153_1": 531,
    "0_1_1_154": 532,
    "0_1_1_154_1": 533,
    "0_1_1_155": 534,
    "0_1_1_155_1": 535,
    "0_1_1_156": 536,
    "0_1_1_156_1": 537,
    "0_1_1_157": 538,
    "0_1_1_157_1": 539,
    "0_1_1_158": 540,
    "0_1_1_158_1": 541,
    "0_1_1_159": 542,
    "0_1_1_159_1": 543,
    "0_1_1_160": 544,
    "0_1_1_160_1": 545,
    "0_1_1_161": 546,
    "0_1_1_161_1": 547,
    "0_1_1_162": 548,
    "0_1_1_162_1": 549,
    "0_1_1_163": 550,
    "0_1_1_163_1": 551,
    "0_1_1_164": 552,
    "0_1_1_164_1": 553,
    "0_1_1_165": 554,
    "0_1_1_165_1": 555,
    "0_1_1_166": 556,
    "0_1_1_166_1": 557,
    "0_1_1_167": 558,
    "0_1_1_167_1": 559,
    "0_1_1_168": 560,
    "0_1_1_168_1": 561,
    "0_1_1_169": 562,
    "0_1_1_169_1": 563,
    "0_1_1_170": 564,
    "0_1_1_170_1": 565,
    "0_1_1_171": 566,
    "0_1_1_171_1": 567,
    "0_1_1_172": 568,
    "0_1_1_172_1": 569,
    "0_1_1_173": 570,
    "0_1_1_173_1": 571,
    "0_1_1_174": 572,
    "0_1_1_174_1": 573,
    "0_1_1_175": 574,
    "0_1_1_175_1": 575,
    "0_1_1_176": 576,
    "0_1_1_176_1": 577,
    "0_1_1_177": 578,
    "0_1_1_177_1": 579,
    "0_1_1_178": 580,
    "0_1_1_178_1": 581,
    "0_1_1_179": 582,
    "0_1_1_179_1": 583,
    "0_1_1_180": 584,
    "0_1_1_180_1": 585,
    "0_1_1_181": 586,
    "0_1_1_181_1": 587,
    "0_1_1_182": 588,
    "0_1_1_182_1": 589,
    "0_1_1_183": 590,
    "0_1_1_183_1": 591,
    "0_1_1_184": 592,
    "0_1_1_184_1": 593,
    "0_1_1_185": 594,
    "0_1_1_185_1": 595,
    "0_1_1_186": 596,
    "0_1_1_186_1": 597,
    "0_1_1_187": 598,
    "0_1_1_187_1": 599,
    "0_1_1_188": 600,
    "0_1_1_188_1": 601,
    "0_1_1_189": 602,
    "0_1_1_189_1": 603,
    "0_1_1_190": 604,
    "0_1_1_190_1": 605,
    "0_1_1_191": 606,
    "0_1_1_191_1": 607,
    "0_1_1_192": 608,
    "0_1_1_192_1": 609,
    "0_1_1_193": 610,
    "0_1_1_193_1": 611,
    "0_1_1_194": 612,
    "0_1_1_194_1": 613,
    "0_1_1_195": 614,
    "0_1_1_195_1": 615,
    "0_1_1_196": 616,
    "0_1_1_196_1": 617,
    "0_1_1_197": 618,
    "0_1_1_197_1": 619,
    "0_1_1_198": 620,
    "0_1_1_198_1": 621,
    "0_1_1_199": 622,
    "0_1_1_199_1": 623,
    "0_1_1_200": 624,
    "0_1_1_200_1": 625,
    "0_1_1_201": 626,
    "0_1_1_201_1": 627,
    "0_1_1_202": 628,
    "0_1_1_202_1": 629,
    "0_1_1_203": 630,
    "0_1_1_203_1": 631,
    "0_1_1_204": 632,
    "0_1_1_204_1": 633,
    "0_1_1_205": 634,
    "0_1_1_205_1": 635,
    "0_1_1_206": 636,
    "0_1_1_206_1": 637,
    "0_1_1_207": 638,
    "0_1_1_207_1": 639,
    "0_1_1_208": 640,
    "0_1_1_208_1": 641,
    "0_1_1_209": 642,
    "0_1_1_209_1": 643,
    "0_1_1_210": 644,
    "0_1_1_210_1": 645,
    "0_1_1_211": 646,
    "0_1_1_211_1": 647,
    "0_1_1_212": 648,
    "0_1_1_212_1": 649,
    "0_1_1_213": 650,
    "0_1_1_213_1": 651,
    "0_1_1_214": 652,
    "0_1_1_214_1": 653,
    "0_1_1_215": 654,
    "0_1_1_215_1": 655,
    "0_1_1_216": 656,
    "0_1_1_216_1": 657,
    "0_1_1_217": 658,
    "0_1_1_217_1": 659,
    "0_1_1_218": 660,
    "0_1_1_218_1": 661,
    "0_1_1_219": 662,
    "0_1_1_219_1": 663,
    "0_1_1_220": 664,
    "0_1_1_220_1": 665,
    "0_1_1_221": 666,
    "0_1_1_221_1": 667,
    "0_1_1_222": 668,
    "0_1_1_222_1": 669,
    "0_1_1_223": 670,
    "0_1_1_223_1": 671,
    "0_1_1_224": 672,
    "0_1_1_224_1": 673,
    "0_1_1_225": 674,
    "0_1_1_225_1": 675,
    "0_1_1_226": 676,
    "0_1_1_226_1": 677,
    "0_1_1_227": 678,
    "0_1_1_227_1": 679,
    "0_1_1_228": 680,
    "0_1_1_228_1": 681,
    "0_1_1_229": 682,
    "0_1_1_229_1": 683,
    "0_1_1_230": 684,
    "0_1_1_230_1": 685,
    "0_1_1_231": 686,
    "0_1_1_231_1": 687,
    "0_1_1_232": 688,
    "0_1_1_232_1": 689,
    "0_1_1_233": 690,
    "0_1_1_233_1": 691,
    "0_1_1_234": 692,
    "0_1_1_234_1": 693,
    "0_1_1_235": 694,
    "0_1_1_235_1": 695,
    "0_1_1_236": 696,
    "0_1_1_236_1": 697,
    "0_1_1_237": 698,
    "0_1_1_237_1": 699,
    "0_1_1_238": 700,
    "0_1_1_238_1": 701,
    "0_1_1_239": 702,
    "0_1_1_239_1": 703,
    "0_1_1_240": 704,
    "0_1_1_240_1": 705,
    "0_1_1_241": 706,
    "0_1_1_241_1": 707,
    "0_1_1_242": 708,
    "0_1_1_242_1": 709,
    "0_1_1_243": 710,
    "0_1_1_243_1": 711,
    "0_1_1_244": 712,
    "0_1_1_244_1": 713,
    "0_1_1_245": 714,
    "0_1_1_245_1": 715,
    "0_1_1_246": 716,
    "0_1_1_246_1": 717,
    "0_1_1_247": 718,
    "0_1_1_247_1": 719,
    "0_1_1_248": 720,
    "0_1_1_248_1": 721,
    "0_1_1_249": 722,
    "0_1_1_249_1": 723,
    "0_1_1_250": 724,
    "0_1_1_250_1": 725,
    "0_1_1_251": 726,
    "0_1_1_251_1": 727,
    "0_1_1_252": 728,
    "0_1_1_252_1": 729,
    "0_1_1_253": 730,
    "0_1_1_253_1": 731,
    "0_1_1_254": 732,
    "0_1_1_254_1": 733,
    "0_1_1_255": 734,
    "0_1_1_255_1": 735,
    "0_1_1_256": 736,
    "0_1_1_256_1": 737,
    "0_1_1_257": 738,
    "0_1_1_257_1": 739,
    "0_1_1_258": 740,
    "0_1_1_258_1": 741,
    "0_1_1_259": 742,
    "0_1_1_259_1": 743,
    "0_1_1_260": 744,
    "0_1_1_260_1": 745,
    "0_1_1_261": 746,
    "0_1_1_261_1": 747,
    "0_1_1_262": 748,
    "0_1_1_262_1": 749,
    "0_1_1_263": 750,
    "0_1_1_263_1": 751,
    "0_1_1_264": 752,
    "0_1_1_264_1": 753,
    "0_1_1_265": 754,
    "0_1_1_265_1": 755,
    "0_1_1_266": 756,
    "0_1_1_266_1": 757,
    "0_1_1_267": 758,
    "0_1_1_267_1": 759,
    "0_1_1_268": 760,
    "0_1_1_268_1": 761,
    "0_1_1_269": 762,
    "0_1_1_269_1": 763,
    "0_1_1_270": 764,
    "0_1_1_270_1": 765,
    "0_1_1_271": 766,
    "0_1_1_271_1": 767,
    "0_1_1_272": 768,
    "0_1_1_272_1": 769,
    "0_1_1_273": 770,
    "0_1_1_273_1": 771,
    "0_1_1_274": 772,
    "0_1_1_274_1": 773,
    "0_1_1_275": 774,
    "0_1_1_275_1": 775,
    "0_1_1_276": 776,
    "0_1_1_276_1": 777,
    "0_1_1_277": 778,
    "0_1_1_277_1": 779,
    "0_1_1_278": 780,
    "0_1_1_278_1": 781,
    "0_1_1_279": 782,
    "0_1_1_279_1": 783,
    "0_1_1_280": 784,
